[Survived] OptionalChaining
backend/controller/exam.js:7:26
 
 export const create_exam = async (req, res) => {
     try {
-        const username = req?.user?.username;
+        const username = req?.user.username;
 
         if (!username) {

[Survived] OptionalChaining
backend/controller/exam.js:7:26
 
 export const create_exam = async (req, res) => {
     try {
-        const username = req?.user?.username;
+        const username = req.user?.username;
 
         if (!username) {

[Killed] BooleanLiteral
backend/controller/exam.js:9:13
     try {
         const username = req?.user?.username;
 
-        if (!username) {
+        if (username) {
             return res.status(404).json({ message: "No Examiner Found" });
         }
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[Killed] ConditionalExpression
backend/controller/exam.js:9:13
     try {
         const username = req?.user?.username;
 
-        if (!username) {
+        if (true) {
             return res.status(404).json({ message: "No Examiner Found" });
         }
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[Killed] BlockStatement
backend/controller/exam.js:15:24
 
         const examiner = await User.findOne({ username });
 
-        if (!examiner) {
-            return res.status(404).json({ message: "No Examiner Found" });
-        }
+        if (!examiner) {}
 
         const {
killedBy: create_exam API Function should return a 404 if the examiner is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ConditionalExpression
backend/controller/exam.js:15:13
 
         const examiner = await User.findOne({ username });
 
-        if (!examiner) {
+        if (false) {
             return res.status(404).json({ message: "No Examiner Found" });
         }
killedBy: create_exam API Function should return a 404 if the examiner is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] BooleanLiteral
backend/controller/exam.js:34:27
             subject,
         } = req.body;
 
-        if (!questions || !Array.isArray(questions) || questions.length === 0) {
+        if (!questions || Array.isArray(questions) || questions.length === 0) {
             return res.status(400).json({ message: "Questions are required" });
         }
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:34:13
             subject,
         } = req.body;
 
-        if (!questions || !Array.isArray(questions) || questions.length === 0) {
+        if (questions || !Array.isArray(questions) || questions.length === 0) {
             return res.status(400).json({ message: "Questions are required" });
         }
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[NoCoverage] ObjectLiteral
backend/controller/exam.js:35:41
         } = req.body;
 
         if (!questions || !Array.isArray(questions) || questions.length === 0) {
-            return res.status(400).json({ message: "Questions are required" });
+            return res.status(400).json({});
         }
 

[Killed] ConditionalExpression
backend/controller/exam.js:39:13
         }
 
         if (
-            !startTime ||
-            !duration ||
-            !title ||
-            !semester ||
-            !examType ||
-            !batch ||
-            !branch ||
-            !total_points ||
-            !status ||
-            !subject
+            true
         ) {
             return res
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:39:13
         }
 
         if (
-            !startTime ||
+            startTime ||
             !duration ||
             !title ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:40:13
 
         if (
             !startTime ||
-            !duration ||
+            duration ||
             !title ||
             !semester ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:41:13
         if (
             !startTime ||
             !duration ||
-            !title ||
+            title ||
             !semester ||
             !examType ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:42:13
             !startTime ||
             !duration ||
             !title ||
-            !semester ||
+            semester ||
             !examType ||
             !batch ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:43:13
             !duration ||
             !title ||
             !semester ||
-            !examType ||
+            examType ||
             !batch ||
             !branch ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:44:13
             !title ||
             !semester ||
             !examType ||
-            !batch ||
+            batch ||
             !branch ||
             !total_points ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:45:13
             !semester ||
             !examType ||
             !batch ||
-            !branch ||
+            branch ||
             !total_points ||
             !status ||
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:46:13
             !examType ||
             !batch ||
             !branch ||
-            !total_points ||
+            total_points ||
             !status ||
             !subject
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:47:13
             !batch ||
             !branch ||
             !total_points ||
-            !status ||
+            status ||
             !subject
         ) {
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BooleanLiteral
backend/controller/exam.js:48:13
             !branch ||
             !total_points ||
             !status ||
-            !subject
+            subject
         ) {
             return res
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[NoCoverage] BlockStatement
backend/controller/exam.js:49:11
             !total_points ||
             !status ||
             !subject
-        ) {
-            return res
-                .status(400)
-                .json({
-                    message: "Missing required fields for creating an exam",
-                });
-        }
+        ) {}
 
         if (startTime) {

[NoCoverage] ObjectLiteral
backend/controller/exam.js:52:23
         ) {
             return res
                 .status(400)
-                .json({
-                    message: "Missing required fields for creating an exam",
-                });
+                .json({});
         }
 

[Survived] BlockStatement
backend/controller/exam.js:57:24
                 });
         }
 
-        if (startTime) {
-            const starttime = new Date(startTime);
-            const currenttime = new Date();
-
-            if (currenttime >= starttime) {
-                return res
-                    .status(400)
-                    .json({
-                        message:
-                            "Start time must be greater than the current time",
-                    });
-            }
-        } else if (status === "Published") {
+        if (startTime) {} else if (status === "Published") {
             return res
                 .status(400)

[Survived] ConditionalExpression
backend/controller/exam.js:57:13
                 });
         }
 
-        if (startTime) {
+        if (false) {
             const starttime = new Date(startTime);
             const currenttime = new Date();

[Killed] EqualityOperator
backend/controller/exam.js:61:17
             const starttime = new Date(startTime);
             const currenttime = new Date();
 
-            if (currenttime >= starttime) {
+            if (currenttime < starttime) {
                 return res
                     .status(400)
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] ConditionalExpression
backend/controller/exam.js:61:17
             const starttime = new Date(startTime);
             const currenttime = new Date();
 
-            if (currenttime >= starttime) {
+            if (true) {
                 return res
                     .status(400)
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[NoCoverage] ObjectLiteral
backend/controller/exam.js:64:27
             if (currenttime >= starttime) {
                 return res
                     .status(400)
-                    .json({
-                        message:
-                            "Start time must be greater than the current time",
-                    });
+                    .json({});
             }
         } else if (status === "Published") {

[NoCoverage] ConditionalExpression
backend/controller/exam.js:69:20
                             "Start time must be greater than the current time",
                     });
             }
-        } else if (status === "Published") {
+        } else if (true) {
             return res
                 .status(400)

[NoCoverage] ConditionalExpression
backend/controller/exam.js:69:20
                             "Start time must be greater than the current time",
                     });
             }
-        } else if (status === "Published") {
+        } else if (false) {
             return res
                 .status(400)

[NoCoverage] StringLiteral
backend/controller/exam.js:72:34
         } else if (status === "Published") {
             return res
                 .status(400)
-                .json({ message: "Can't publish exam without starting time" });
+                .json({ message: "" });
         }
 

[Survived] ConditionalExpression
backend/controller/exam.js:78:21
         const getQuestionIds = async () => {
             let questionIds = [];
             for (const question of questions) {
-                if (question?.questionId) {
+                if (false) {
                     questionIds.push(question.questionId);
 

[Timeout] ConditionalExpression
backend/controller/exam.js:78:21
         const getQuestionIds = async () => {
             let questionIds = [];
             for (const question of questions) {
-                if (question?.questionId) {
+                if (true) {
                     questionIds.push(question.questionId);
 

[NoCoverage] ConditionalExpression
backend/controller/exam.js:84:25
                     const newQuestion = await Question.findOne({
                         questionId: question.questionId,
                     });
-                    if (!newQuestion) {
+                    if (false) {
                         return res
                             .status(400)

[NoCoverage] BooleanLiteral
backend/controller/exam.js:84:25
                     const newQuestion = await Question.findOne({
                         questionId: question.questionId,
                     });
-                    if (!newQuestion) {
+                    if (newQuestion) {
                         return res
                             .status(400)

[NoCoverage] BlockStatement
backend/controller/exam.js:90:58
                             .json({ message: "Question not found" });
                     }
 
-                    if (newQuestion.subject !== subject) {
-                        return res
-                            .status(401)
-                            .json({ message: "Subject not match" });
-                    }
+                    if (newQuestion.subject !== subject) {}
                 } else {
                     if (

[NoCoverage] ConditionalExpression
backend/controller/exam.js:90:25
                             .json({ message: "Question not found" });
                     }
 
-                    if (newQuestion.subject !== subject) {
+                    if (false) {
                         return res
                             .status(401)

[NoCoverage] StringLiteral
backend/controller/exam.js:93:46
                     if (newQuestion.subject !== subject) {
                         return res
                             .status(401)
-                            .json({ message: "Subject not match" });
+                            .json({ message: "" });
                     }
                 } else {

[Killed] LogicalOperator
backend/controller/exam.js:97:25
                     }
                 } else {
                     if (
-                        !question.desc ||
-                        !question.options ||
-                        question.points == null ||
+                        (!question.desc || !question.options) && question.points == null ||
                         !question.difficulty ||
                         question.answer == null
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] ConditionalExpression
backend/controller/exam.js:97:25
                     }
                 } else {
                     if (
-                        !question.desc ||
-                        !question.options ||
-                        question.points == null ||
-                        !question.difficulty ||
-                        question.answer == null
+                        false
                     ) {
                         return res
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Survived] BooleanLiteral
backend/controller/exam.js:98:25
                 } else {
                     if (
                         !question.desc ||
-                        !question.options ||
+                        question.options ||
                         question.points == null ||
                         !question.difficulty ||

[Killed] ConditionalExpression
backend/controller/exam.js:99:25
                     if (
                         !question.desc ||
                         !question.options ||
-                        question.points == null ||
+                        false ||
                         !question.difficulty ||
                         question.answer == null
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] EqualityOperator
backend/controller/exam.js:99:25
                     if (
                         !question.desc ||
                         !question.options ||
-                        question.points == null ||
+                        question.points != null ||
                         !question.difficulty ||
                         question.answer == null
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Survived] BooleanLiteral
backend/controller/exam.js:100:25
                         !question.desc ||
                         !question.options ||
                         question.points == null ||
-                        !question.difficulty ||
+                        question.difficulty ||
                         question.answer == null
                     ) {

[Survived] ConditionalExpression
backend/controller/exam.js:101:25
                         !question.options ||
                         question.points == null ||
                         !question.difficulty ||
-                        question.answer == null
+                        false
                     ) {
                         return res

[Survived] EqualityOperator
backend/controller/exam.js:101:25
                         !question.options ||
                         question.points == null ||
                         !question.difficulty ||
-                        question.answer == null
+                        question.answer != null
                     ) {
                         return res

[Killed] BlockStatement
backend/controller/exam.js:102:23
                         question.points == null ||
                         !question.difficulty ||
                         question.answer == null
-                    ) {
-                        return res
-                            .status(400)
-                            .json({ message: "Missing required fields for creating a question" });
-                    }
+                    ) {}
 
                     const newQuestion = new Question({
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({
      message: "Missing required fields for creating a question",
  }))

[Killed] BlockStatement
backend/controller/exam.js:127:13
         };
 
         let questionIds = [];
-        try {
-            questionIds = await getQuestionIds();
-        } catch (err) {
+        try {} catch (err) {
             console.log(err);
             return res
killedBy: create_exam API Function should return a 400 error if a question is missing required fields
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[NoCoverage] BlockStatement
backend/controller/exam.js:129:23
         let questionIds = [];
         try {
             questionIds = await getQuestionIds();
-        } catch (err) {
-            console.log(err);
-            return res
-                .status(400)
-                .json({ message: `Error creating questions: ${err.message}` });
-        }
+        } catch (err) {}
 
         const exam = new Exam({

[Survived] StringLiteral
backend/controller/exam.js:137:22
         }
 
         const exam = new Exam({
-            creator: `${examiner.firstname} ${examiner.lastname}`,
+            creator: ``,
             creatorUsername: username,
             questions: questionIds,

[Killed] BlockStatement
backend/controller/exam.js:157:21
         return res
             .status(200)
             .json({ message: "Exam created successfully.", exam });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: create_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] ObjectLiteral
backend/controller/exam.js:159:37
             .json({ message: "Exam created successfully.", exam });
     } catch (error) {
         console.log(error);
-        return res.status(500).json({ message: error.message });
+        return res.status(500).json({});
     }
 };
killedBy: create_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Database error' }))

[Killed] ConditionalExpression
backend/controller/exam.js:174:13
 
         const examiner = await User.findOne({ username });
 
-        if (!examiner) {
+        if (true) {
             return res.status(404).json({ message: "No Student Found" });
         }
killedBy: update_exam API Function should return 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Exam not found.' }))

[Timeout] BlockStatement
backend/controller/exam.js:174:24
 
         const examiner = await User.findOne({ username });
 
-        if (!examiner) {
-            return res.status(404).json({ message: "No Student Found" });
-        }
+        if (!examiner) {}
 
         const { examId } = req.params;

[Killed] BlockStatement
backend/controller/exam.js:197:24
         // Find the exam by examId and update it
         const examData = await Exam.findOne({ examId: examId });
 
-        if (!examData) {
-            return res.status(404).json({ message: "Exam not found." });
-        }
+        if (!examData) {}
 
         if (!questions || !Array.isArray(questions) || questions.length === 0) {
killedBy: update_exam API Function should return 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ConditionalExpression
backend/controller/exam.js:197:13
         // Find the exam by examId and update it
         const examData = await Exam.findOne({ examId: examId });
 
-        if (!examData) {
+        if (false) {
             return res.status(404).json({ message: "Exam not found." });
         }
killedBy: update_exam API Function should return 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ObjectLiteral
backend/controller/exam.js:198:41
         const examData = await Exam.findOne({ examId: examId });
 
         if (!examData) {
-            return res.status(404).json({ message: "Exam not found." });
+            return res.status(404).json({});
         }
 
killedBy: update_exam API Function should return 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Exam not found.' }))

[Killed] EqualityOperator
backend/controller/exam.js:201:56
             return res.status(404).json({ message: "Exam not found." });
         }
 
-        if (!questions || !Array.isArray(questions) || questions.length === 0) {
+        if (!questions || !Array.isArray(questions) || questions.length !== 0) {
             return res.status(400).json({ message: "Questions are required" });
         }
killedBy: update_exam API Function should update an exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(200))

[Survived] ConditionalExpression
backend/controller/exam.js:224:13
                 });
         }
 
-        if (startTime) {
+        if (true) {
             const starttime = new Date(startTime);
             const currenttime = new Date();

[NoCoverage] EqualityOperator
backend/controller/exam.js:236:20
                             "Start time must be greater than the current time",
                     });
             }
-        } else if (status === "Published") {
+        } else if (status !== "Published") {
             return res
                 .status(400)

[NoCoverage] ObjectLiteral
backend/controller/exam.js:239:23
         } else if (status === "Published") {
             return res
                 .status(400)
-                .json({ message: "Can't publish exam without starting time" });
+                .json({});
         }
 

[Survived] BlockStatement
backend/controller/exam.js:245:43
         const getQuestionIds = async () => {
             let questionIds = [];
             for (const question of questions) {
-                if (question?.questionId) {
-                    const newQuestion = await Question.findOneAndUpdate(
-                        { questionId: question.questionId },
-                        question,
-                        { new: true }
-                    );
-
-                    questionIds.push(newQuestion.questionId);
-
-                    if (!newQuestion) {
-                        return res
-                            .status(400)
-                            .json({ message: "Question not found" });
-                    }
-
-                    if (newQuestion.subject !== subject) {
-                        return res
-                            .status(401)
-                            .json({ message: "Subject not match" });
-                    }
-                } else {
+                if (question?.questionId) {} else {
                     if (
                         !question.desc ||

[Survived] BooleanLiteral
backend/controller/exam.js:249:32
                     const newQuestion = await Question.findOneAndUpdate(
                         { questionId: question.questionId },
                         question,
-                        { new: true }
+                        { new: false }
                     );
 

[NoCoverage] BlockStatement
backend/controller/exam.js:254:39
 
                     questionIds.push(newQuestion.questionId);
 
-                    if (!newQuestion) {
-                        return res
-                            .status(400)
-                            .json({ message: "Question not found" });
-                    }
+                    if (!newQuestion) {}
 
                     if (newQuestion.subject !== subject) {

[Survived] BooleanLiteral
backend/controller/exam.js:254:25
 
                     questionIds.push(newQuestion.questionId);
 
-                    if (!newQuestion) {
+                    if (newQuestion) {
                         return res
                             .status(400)

[Survived] ConditionalExpression
backend/controller/exam.js:260:25
                             .json({ message: "Question not found" });
                     }
 
-                    if (newQuestion.subject !== subject) {
+                    if (true) {
                         return res
                             .status(401)

[NoCoverage] ObjectLiteral
backend/controller/exam.js:263:35
                     if (newQuestion.subject !== subject) {
                         return res
                             .status(401)
-                            .json({ message: "Subject not match" });
+                            .json({});
                     }
                 } else {
