[Killed] BlockStatement
backend/controller/authentication.js:11:51
 import { create_student_templet, create_examiner_templet } from '../utils/mailTemplets.js'
 
 
-export const create_session = async (req, res) => {
-    try {
-        const { emailUsername, password } = req.body;
-        const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
-
-        if (!user || user.username === "admin") {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-        const pass_match = await bcrypt.compare(password, user.password);
-        if (!pass_match) {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-
-        const token = generateToken(user);
-        return res.status(200).json({ token: token, username: user.username, role: user.role, message: "Logged in successfully" });
-
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const create_session = async (req, res) => {};
 
 export const admin_login = async (req, res) => {
killedBy: create_session API Function should return a 401 error if user is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] BlockStatement
backend/controller/authentication.js:12:9
 
 
 export const create_session = async (req, res) => {
-    try {
-        const { emailUsername, password } = req.body;
-        const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
-
-        if (!user || user.username === "admin") {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-        const pass_match = await bcrypt.compare(password, user.password);
-        if (!pass_match) {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-
-        const token = generateToken(user);
-        return res.status(200).json({ token: token, username: user.username, role: user.role, message: "Logged in successfully" });
-
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: create_session API Function should return a 401 error if user is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Survived] ObjectLiteral
backend/controller/authentication.js:14:41
 export const create_session = async (req, res) => {
     try {
         const { emailUsername, password } = req.body;
-        const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
+        const user = await User.findOne({});
 
         if (!user || user.username === "admin") {

[Survived] ArrayDeclaration
backend/controller/authentication.js:14:48
 export const create_session = async (req, res) => {
     try {
         const { emailUsername, password } = req.body;
-        const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
+        const user = await User.findOne({ $or: [] });
 
         if (!user || user.username === "admin") {

[Killed] LogicalOperator
backend/controller/authentication.js:16:13
         const { emailUsername, password } = req.body;
         const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
 
-        if (!user || user.username === "admin") {
+        if (!user && user.username === "admin") {
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
killedBy: create_session API Function should return a 401 error if user is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] BlockStatement
backend/controller/authentication.js:16:49
         const { emailUsername, password } = req.body;
         const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
 
-        if (!user || user.username === "admin") {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
+        if (!user || user.username === "admin") {}
         const pass_match = await bcrypt.compare(password, user.password);
         if (!pass_match) {
killedBy: create_session API Function should return a 401 error if user is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] StringLiteral
backend/controller/authentication.js:17:52
         const user = await User.findOne({ $or: [{ email: emailUsername }, { username: emailUsername }] });
 
         if (!user || user.username === "admin") {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
+            return res.status(401).json({ message: "" });
         }
         const pass_match = await bcrypt.compare(password, user.password);
killedBy: create_session API Function should return a 401 error if user is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid Email/Username or Password!" }))

[Killed] BooleanLiteral
backend/controller/authentication.js:20:13
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
         const pass_match = await bcrypt.compare(password, user.password);
-        if (!pass_match) {
+        if (pass_match) {
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
killedBy: create_session API Function should return a 401 error if password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] BlockStatement
backend/controller/authentication.js:20:26
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
         const pass_match = await bcrypt.compare(password, user.password);
-        if (!pass_match) {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
+        if (!pass_match) {}
 
         const token = generateToken(user);
killedBy: create_session API Function should return a 401 error if password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] ObjectLiteral
backend/controller/authentication.js:21:41
         }
         const pass_match = await bcrypt.compare(password, user.password);
         if (!pass_match) {
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
+            return res.status(401).json({});
         }
 
killedBy: create_session API Function should return a 401 error if password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid Email/Username or Password!" }))

[NoCoverage] StringLiteral
backend/controller/authentication.js:25:104
         }
 
         const token = generateToken(user);
-        return res.status(200).json({ token: token, username: user.username, role: user.role, message: "Logged in successfully" });
+        return res.status(200).json({ token: token, username: user.username, role: user.role, message: "" });
 
     } catch (error) {

[Killed] BlockStatement
backend/controller/authentication.js:33:48
     }
 };
 
-export const admin_login = async (req, res) => {
-    try{
-        const { password } = req.body;
-
-        const admin = await User.findOne({username: "admin"});
-
-        if(!admin){
-            return res.status(401).json({ message: "Admin not found"});
-        }
-
-        const pass_match = await bcrypt.compare(password, admin.password);
-        if(!admin || !pass_match){
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-
-        const token = generateToken(admin);
-        return res.status(200).json({ token: token, username: admin.username, role: admin.role, message: "Logged in successfully" });
-
-    } catch(error){
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const admin_login = async (req, res) => {};
 
 export const create_student = async (req, res) => {
killedBy: admin_login API Function should return a 401 error if admin is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Killed] BlockStatement
backend/controller/authentication.js:34:8
 };
 
 export const admin_login = async (req, res) => {
-    try{
-        const { password } = req.body;
-
-        const admin = await User.findOne({username: "admin"});
-
-        if(!admin){
-            return res.status(401).json({ message: "Admin not found"});
-        }
-
-        const pass_match = await bcrypt.compare(password, admin.password);
-        if(!admin || !pass_match){
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
-        }
-
-        const token = generateToken(admin);
-        return res.status(200).json({ token: token, username: admin.username, role: admin.role, message: "Logged in successfully" });
-
-    } catch(error){
+    try{} catch(error){
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: admin_login API Function should return a 401 error if admin is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Survived] ObjectLiteral
backend/controller/authentication.js:37:42
     try{
         const { password } = req.body;
 
-        const admin = await User.findOne({username: "admin"});
+        const admin = await User.findOne({});
 
         if(!admin){

[Killed] ConditionalExpression
backend/controller/authentication.js:39:12
 
         const admin = await User.findOne({username: "admin"});
 
-        if(!admin){
+        if(false){
             return res.status(401).json({ message: "Admin not found"});
         }
killedBy: admin_login API Function should return a 401 error if admin is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Killed] BooleanLiteral
backend/controller/authentication.js:39:12
 
         const admin = await User.findOne({username: "admin"});
 
-        if(!admin){
+        if(admin){
             return res.status(401).json({ message: "Admin not found"});
         }
killedBy: admin_login API Function should return a 401 error if admin is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Survived] StringLiteral
backend/controller/authentication.js:40:52
         const admin = await User.findOne({username: "admin"});
 
         if(!admin){
-            return res.status(401).json({ message: "Admin not found"});
+            return res.status(401).json({ message: ""});
         }
 

[Survived] ObjectLiteral
backend/controller/authentication.js:40:41
         const admin = await User.findOne({username: "admin"});
 
         if(!admin){
-            return res.status(401).json({ message: "Admin not found"});
+            return res.status(401).json({});
         }
 

[Killed] BooleanLiteral
backend/controller/authentication.js:44:22
         }
 
         const pass_match = await bcrypt.compare(password, admin.password);
-        if(!admin || !pass_match){
+        if(!admin || pass_match){
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
killedBy: admin_login API Function should return a 401 error if the password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Killed] LogicalOperator
backend/controller/authentication.js:44:12
         }
 
         const pass_match = await bcrypt.compare(password, admin.password);
-        if(!admin || !pass_match){
+        if(!admin && !pass_match){
             return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
         }
killedBy: admin_login API Function should return a 401 error if the password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWithExactly(401))

[Killed] StringLiteral
backend/controller/authentication.js:45:52
 
         const pass_match = await bcrypt.compare(password, admin.password);
         if(!admin || !pass_match){
-            return res.status(401).json({ message: 'Invalid Email/Username or Password!' });
+            return res.status(401).json({ message: "" });
         }
 
killedBy: admin_login API Function should return a 401 error if the password does not match
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid Email/Username or Password!" }))

[NoCoverage] StringLiteral
backend/controller/authentication.js:49:106
         }
 
         const token = generateToken(admin);
-        return res.status(200).json({ token: token, username: admin.username, role: admin.role, message: "Logged in successfully" });
+        return res.status(200).json({ token: token, username: admin.username, role: admin.role, message: "" });
 
     } catch(error){

[Killed] BooleanLiteral
backend/controller/authentication.js:61:47
     try {
         const { firstname, lastname, middlename, dob, mobileno, email, gender, batch, branch, graduation } = req.body;
 
-        if(!firstname || !lastname || !dob || !mobileno || !email || !gender || !batch || !branch || !graduation){
+        if(!firstname || !lastname || !dob || mobileno || !email || !gender || !batch || !branch || !graduation){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: create_student API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid email format." }))

[Killed] BooleanLiteral
backend/controller/authentication.js:61:60
     try {
         const { firstname, lastname, middlename, dob, mobileno, email, gender, batch, branch, graduation } = req.body;
 
-        if(!firstname || !lastname || !dob || !mobileno || !email || !gender || !batch || !branch || !graduation){
+        if(!firstname || !lastname || !dob || !mobileno || email || !gender || !batch || !branch || !graduation){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: create_student API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid email format." }))

[Killed] Regex
backend/controller/authentication.js:66:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: create_student API Function should return a 400 error for invalid mobile number format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Mobile number must be exactly 10 digits." }))

[Killed] Regex
backend/controller/authentication.js:66:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[\s@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: create_student API Function should return a 400 error for invalid mobile number format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Mobile number must be exactly 10 digits." }))

[Killed] StringLiteral
backend/controller/authentication.js:68:52
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
-            return res.status(400).json({ message: 'Invalid email format.' });
+            return res.status(400).json({ message: "" });
         }
 
killedBy: create_student API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid email format." }))

[Killed] Regex
backend/controller/authentication.js:72:31
         }
 
         // Check mobile number length (assuming mobile number should be exactly 10 digits)
-        const mobilenoRegex = /^\d{10}$/;
+        const mobilenoRegex = /^\D{10}$/;
         if (!mobilenoRegex.test(mobileno)) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
killedBy: create_student API Function should return a 400 error for invalid date of birth format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid date of birth format. Use YYYY-MM-DD." }))

[Killed] ObjectLiteral
backend/controller/authentication.js:74:41
         // Check mobile number length (assuming mobile number should be exactly 10 digits)
         const mobilenoRegex = /^\d{10}$/;
         if (!mobilenoRegex.test(mobileno)) {
-            return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
+            return res.status(400).json({});
         }
 
killedBy: create_student API Function should return a 400 error for invalid mobile number format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Mobile number must be exactly 10 digits." }))

[Survived] Regex
backend/controller/authentication.js:78:26
         }
 
         // DOB validation (expecting format 'YYYY-MM-DD')
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\d{4}-\d{2}-\d$/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });

[Survived] Regex
backend/controller/authentication.js:78:26
         }
 
         // DOB validation (expecting format 'YYYY-MM-DD')
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\d{4}-\D{2}-\d{2}$/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });

[Killed] ConditionalExpression
backend/controller/authentication.js:79:13
 
         // DOB validation (expecting format 'YYYY-MM-DD')
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
-        if (!dobRegex.test(dob)) {
+        if (false) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
         }
killedBy: create_student API Function should return a 400 error for invalid date of birth format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Invalid date of birth format. Use YYYY-MM-DD." }))

[NoCoverage] LogicalOperator
backend/controller/authentication.js:87:13
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if ((date.getFullYear() !== year || date.getMonth() + 1 !== month) && date.getDate() !== day) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }

[NoCoverage] ConditionalExpression
backend/controller/authentication.js:87:13
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if (false) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:101:25
 
         const maxStudentID = await Student.aggregate([
             {
-                $match: {
-                  batch: Number(batch),
-                  graduation: graduation
-                }
+                $match: {}
               },
             {

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:106:13
                   graduation: graduation
                 }
               },
-            {
-              $group: {
-                _id: null, 
-                maxStudentID: { $max: "$username" } 
-              }
-            }
+            {}
         ]);
         

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:109:31
             {
               $group: {
                 _id: null, 
-                maxStudentID: { $max: "$username" } 
+                maxStudentID: {} 
               }
             }

[NoCoverage] StringLiteral
backend/controller/authentication.js:109:39
             {
               $group: {
                 _id: null, 
-                maxStudentID: { $max: "$username" } 
+                maxStudentID: { $max: "" } 
               }
             }

[NoCoverage] EqualityOperator
backend/controller/authentication.js:115:34
         ]);
         
         // Extract the maximum student ID or handle case where no documents are found
-        const maximumStudentID = maxStudentID.length > 0 ? maxStudentID[0].maxStudentID : null;
+        const maximumStudentID = maxStudentID.length >= 0 ? maxStudentID[0].maxStudentID : null;
 
         console.log(maxStudentID);

[NoCoverage] ConditionalExpression
backend/controller/authentication.js:115:34
         ]);
         
         // Extract the maximum student ID or handle case where no documents are found
-        const maximumStudentID = maxStudentID.length > 0 ? maxStudentID[0].maxStudentID : null;
+        const maximumStudentID = true ? maxStudentID[0].maxStudentID : null;
 
         console.log(maxStudentID);

[NoCoverage] ConditionalExpression
backend/controller/authentication.js:121:12
         
         
         let studentId = generate_student_id(batch, graduation, 1)
-        if(maximumStudentID){
+        if(true){
             studentId = Number(maximumStudentID) + 1;
         }

[NoCoverage] ConditionalExpression
backend/controller/authentication.js:121:12
         
         
         let studentId = generate_student_id(batch, graduation, 1)
-        if(maximumStudentID){
+        if(false){
             studentId = Number(maximumStudentID) + 1;
         }

[NoCoverage] ArithmeticOperator
backend/controller/authentication.js:122:25
         
         let studentId = generate_student_id(batch, graduation, 1)
         if(maximumStudentID){
-            studentId = Number(maximumStudentID) + 1;
+            studentId = Number(maximumStudentID) - 1;
         }
         

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:153:37
 
         await send_mail(user.email, "Welcome to eExam", create_student_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
 
-        return res.status(200).json({ message: "Student created successfully", user: savedUser });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[NoCoverage] BlockStatement
backend/controller/authentication.js:154:21
         await send_mail(user.email, "Welcome to eExam", create_student_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
 
         return res.status(200).json({ message: "Student created successfully", user: savedUser });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 }
 

[Killed] BooleanLiteral
backend/controller/authentication.js:164:83
     try {
         const { username, firstname, lastname, middlename, dob, mobileno, email, gender } = req.body;
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender){
+        if(!username || !firstname || !lastname || !dob || !mobileno || !email || gender){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: create_examiner API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: 'Invalid email format.' }))

[Killed] BooleanLiteral
backend/controller/authentication.js:164:52
     try {
         const { username, firstname, lastname, middlename, dob, mobileno, email, gender } = req.body;
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender){
+        if(!username || !firstname || !lastname || dob || !mobileno || !email || !gender){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: create_examiner API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: 'Invalid email format.' }))

[Survived] StringLiteral
backend/controller/authentication.js:194:22
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
 
-        const role = "Examiner";
+        const role = "";
         const password = generate_password(8);
 

[Survived] ObjectLiteral
backend/controller/authentication.js:199:31
 
         const hashedPassword = await bcrypt.hash(password, 10);
 
-        const user = new User({
-            username,
-            firstname,
-            lastname,
-            middlename,
-            dob:date,
-            mobileno,
-            email,
-            gender,
-            role,
-            password: hashedPassword,
-        });
+        const user = new User({});
 
         const savedUser = await user.save();

[NoCoverage] ArrayDeclaration
backend/controller/authentication.js:217:33
         const examiner = new Examiner({
             username: username,
             prepaprepared_exams: [],
-            prepared_questions: []
+            prepared_questions: ["Stryker was here"]
         });
 

[NoCoverage] StringLiteral
backend/controller/authentication.js:222:81
 
         await examiner.save();
 
-        await send_mail(user.email, "Welcome to eExam", create_examiner_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
+        await send_mail(user.email, "Welcome to eExam", create_examiner_templet(``, user.username, password, process.env.FRONTEND_URL));
 
         return res.status(200).json({ message: "Examiner created successfully", user: savedUser});

[NoCoverage] StringLiteral
backend/controller/authentication.js:222:37
 
         await examiner.save();
 
-        await send_mail(user.email, "Welcome to eExam", create_examiner_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
+        await send_mail(user.email, "", create_examiner_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
 
         return res.status(200).json({ message: "Examiner created successfully", user: savedUser});

[Killed] BlockStatement
backend/controller/authentication.js:225:21
         await send_mail(user.email, "Welcome to eExam", create_examiner_templet(`${user.firstname} ${user.lastname}`, user.username, password, process.env.FRONTEND_URL));
 
         return res.status(200).json({ message: "Examiner created successfully", user: savedUser});
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: create_examiner API Function should return a 500 error if there is a server error
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] BlockStatement
backend/controller/authentication.js:235:72
     try {
         const { username, firstname, mobileno, email, password } = req.body;
 
-        if(!username || !firstname || !mobileno || !email || !password){
-            return res.status(400).json({ message: 'All fields are required!' });
-        }
+        if(!username || !firstname || !mobileno || !email || !password){}
 
         // Email validation (basic regex pattern for email format)
killedBy: create_admin API Function should return a 400 error if required fields are missing
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: 'All fields are required!' }))

[Killed] BooleanLiteral
backend/controller/authentication.js:235:62
     try {
         const { username, firstname, mobileno, email, password } = req.body;
 
-        if(!username || !firstname || !mobileno || !email || !password){
+        if(!username || !firstname || !mobileno || !email || password){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: create_admin API Function should return a 200 response with a success message for valid inputs
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(200))
