[Killed] ObjectLiteral
backend/controller/authentication.js:236:41
         const { username, firstname, mobileno, email, password } = req.body;
 
         if(!username || !firstname || !mobileno || !email || !password){
-            return res.status(400).json({ message: 'All fields are required!' });
+            return res.status(400).json({});
         }
 
killedBy: create_admin API Function should return a 400 error if required fields are missing
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: 'All fields are required!' }))

[Killed] Regex
backend/controller/authentication.js:240:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[^\s@]+\.[\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: create_admin API Function should return a 200 response with a success message for valid inputs
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(200))

[Survived] StringLiteral
backend/controller/authentication.js:251:22
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
 
-        const role = "Admin";
+        const role = "";
         const hashedPassword = await bcrypt.hash(password, 10);
 

[Survived] ObjectLiteral
backend/controller/authentication.js:254:31
         const role = "Admin";
         const hashedPassword = await bcrypt.hash(password, 10);
 
-        const user = new User({
-            username,
-            firstname,
-            mobileno,
-            email,
-            role,
-            password: hashedPassword,
-        });
+        const user = new User({});
 
         await user.save();

[Killed] StringLiteral
backend/controller/authentication.js:265:48
 
         await user.save();
 
-        return res.status(200).json({ message: "Admin created successfully" });
+        return res.status(200).json({ message: "" });
     } catch (error) {
         console.log(error);
killedBy: create_admin API Function should return a 200 response with a success message for valid inputs
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: 'Admin created successfully' }))

[Killed] BlockStatement
backend/controller/authentication.js:266:21
         await user.save();
 
         return res.status(200).json({ message: "Admin created successfully" });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: create_admin API Function should return a 500 error if there is a server error
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] ConditionalExpression
backend/controller/authentication.js:275:13
 export const forgot_password = async (req, res) => {
     try {
         const { email } = req.body;
-        if (!email) return res.status(400).json({message : "An email is required." } );
+        if (true) return res.status(400).json({message : "An email is required." } );
 
         // Email validation (basic regex pattern for email format)
killedBy: forgot_password API Function should return a 400 error for invalid email format
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Invalid email format.' }))

[Killed] ConditionalExpression
backend/controller/authentication.js:275:13
 export const forgot_password = async (req, res) => {
     try {
         const { email } = req.body;
-        if (!email) return res.status(400).json({message : "An email is required." } );
+        if (false) return res.status(400).json({message : "An email is required." } );
 
         // Email validation (basic regex pattern for email format)
killedBy: forgot_password API Function should return a 400 error if email is not provided
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'An email is required.' }))

[Killed] Regex
backend/controller/authentication.js:278:28
         if (!email) return res.status(400).json({message : "An email is required." } );
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: forgot_password API Function should return a 401 error if no user is found with the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] Regex
backend/controller/authentication.js:278:28
         if (!email) return res.status(400).json({message : "An email is required." } );
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: forgot_password API Function should return a 401 error if no user is found with the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] StringLiteral
backend/controller/authentication.js:287:51
         const user = await User.findOne({ email: email });
 
         if (!user) {
-            return res.status(401).json({message: "No account found with the provided email."});
+            return res.status(401).json({message: ""});
         }
 
killedBy: forgot_password API Function should return a 401 error if no user is found with the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'No account found with the provided email.' }))

[Survived] ObjectLiteral
backend/controller/authentication.js:290:48
             return res.status(401).json({message: "No account found with the provided email."});
         }
 
-        const existing_otp = await Otp.findOne({email : email});
+        const existing_otp = await Otp.findOne({});
         if(existing_otp){
             return res.status(200).json({message : "Otp already sent"});

[Survived] ConditionalExpression
backend/controller/authentication.js:291:12
         }
 
         const existing_otp = await Otp.findOne({email : email});
-        if(existing_otp){
+        if(true){
             return res.status(200).json({message : "Otp already sent"});
         }

[Timeout] BlockStatement
backend/controller/authentication.js:291:25
         }
 
         const existing_otp = await Otp.findOne({email : email});
-        if(existing_otp){
-            return res.status(200).json({message : "Otp already sent"});
-        }
+        if(existing_otp){}
 
         const otp = generate_otp();

[Killed] ObjectLiteral
backend/controller/authentication.js:292:41
 
         const existing_otp = await Otp.findOne({email : email});
         if(existing_otp){
-            return res.status(200).json({message : "Otp already sent"});
+            return res.status(200).json({});
         }
 
killedBy: forgot_password API Function should return 200 if OTP is already sent
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Otp already sent' }))

[Killed] StringLiteral
backend/controller/authentication.js:292:52
 
         const existing_otp = await Otp.findOne({email : email});
         if(existing_otp){
-            return res.status(200).json({message : "Otp already sent"});
+            return res.status(200).json({message : ""});
         }
 
killedBy: forgot_password API Function should return 200 if OTP is already sent
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Otp already sent' }))

[NoCoverage] ArithmeticOperator
backend/controller/authentication.js:302:24
             email: email,
             otp: otp,
             createdAt: Date.now(),
-            expiresAt: Date.now() + 600000  // 10 minutes
+            expiresAt: Date.now() - 600000  // 10 minutes
         });
 

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:312:19
         
         return res.status(200).json({
             message: "Password reset OTP email sent",
-            data: {
-                email: user.email,
-            },
+            data: {},
         });
     } catch (error) {

[Killed] BooleanLiteral
backend/controller/authentication.js:325:13
 export const resend_otp = async (req, res) => {
     try {
         const { email } = req.body;
-        if (!email) return res.status(400).json({message : "An email is required." });
+        if (email) return res.status(400).json({message : "An email is required." });
 
         // Email validation (basic regex pattern for email format)
killedBy: resend_otp API Function should return a 400 error if email is missing
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'An email is required.' }))

[Survived] ObjectLiteral
backend/controller/authentication.js:334:41
         }
 
         // Check if user exists
-        const user = await User.findOne({ email: email });
+        const user = await User.findOne({});
         if (!user) {
             return res.status(401).json({message: "No account found with the provided email."});

[Timeout] BooleanLiteral
backend/controller/authentication.js:335:13
 
         // Check if user exists
         const user = await User.findOne({ email: email });
-        if (!user) {
+        if (user) {
             return res.status(401).json({message: "No account found with the provided email."});
         }

[Timeout] ConditionalExpression
backend/controller/authentication.js:335:13
 
         // Check if user exists
         const user = await User.findOne({ email: email });
-        if (!user) {
+        if (false) {
             return res.status(401).json({message: "No account found with the provided email."});
         }

[Killed] ObjectLiteral
backend/controller/authentication.js:336:41
         // Check if user exists
         const user = await User.findOne({ email: email });
         if (!user) {
-            return res.status(401).json({message: "No account found with the provided email."});
+            return res.status(401).json({});
         }
 
killedBy: resend_otp API Function should return a 401 error if no account is found with the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'No account found with the provided email.' }))

[NoCoverage] BlockStatement
backend/controller/authentication.js:340:25
         }
 
         const existing_otp = await Otp.findOne({email : email});
-        if(existing_otp){
-            // Send OTP email for password reset
-            await send_otp(user.email, existing_otp.otp);
-
-            return res.status(200).json({message : "Otp resent successfully"});
-        }
+        if(existing_otp){}
 
         const otp = generate_otp();

[NoCoverage] ConditionalExpression
backend/controller/authentication.js:340:12
         }
 
         const existing_otp = await Otp.findOne({email : email});
-        if(existing_otp){
+        if(false){
             // Send OTP email for password reset
             await send_otp(user.email, existing_otp.otp);

[NoCoverage] StringLiteral
backend/controller/authentication.js:344:52
             // Send OTP email for password reset
             await send_otp(user.email, existing_otp.otp);
 
-            return res.status(200).json({message : "Otp resent successfully"});
+            return res.status(200).json({message : ""});
         }
 

[NoCoverage] ObjectLiteral
backend/controller/authentication.js:361:37
         
         await send_otp(user.email, otp);
         
-        return res.status(200).json({
-            message: "Password reset OTP email sent",
-            data: {
-                email: user.email,
-            },
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[NoCoverage] StringLiteral
backend/controller/authentication.js:362:22
         await send_otp(user.email, otp);
         
         return res.status(200).json({
-            message: "Password reset OTP email sent",
+            message: "",
             data: {
                 email: user.email,

[Killed] ConditionalExpression
backend/controller/authentication.js:377:13
     try {
         const { email, otp, password } = req.body;
 
-        if (!email || !otp || !password) {
+        if (false) {
             return res.status(400).json({message: "Email and OTP are required" });
         }
killedBy: verify_otp API Function should return a 400 error if email, otp, or password is missing
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[Killed] BooleanLiteral
backend/controller/authentication.js:377:31
     try {
         const { email, otp, password } = req.body;
 
-        if (!email || !otp || !password) {
+        if (!email || !otp || password) {
             return res.status(400).json({message: "Email and OTP are required" });
         }
killedBy: verify_otp API Function should return a 400 error if password is too short
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Password must be at least 8 characters long.' }))

[Killed] ConditionalExpression
backend/controller/authentication.js:382:13
         }
 
         // Check password length (e.g., minimum 8 characters)
-        if (password.length < 8) {
+        if (true) {
             return res.status(400).json({ message: 'Password must be at least 8 characters long.' });
         }
killedBy: verify_otp API Function should return a 400 error if OTP record does not exist for the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Account record doesn't exist" }))

[Survived] EqualityOperator
backend/controller/authentication.js:382:13
         }
 
         // Check password length (e.g., minimum 8 characters)
-        if (password.length < 8) {
+        if (password.length <= 8) {
             return res.status(400).json({ message: 'Password must be at least 8 characters long.' });
         }

[Killed] BlockStatement
backend/controller/authentication.js:389:30
         // Find OTP records for the user by email
         const userOTPRecords = await Otp.findOne({ email : email });
 
-        if (!userOTPRecords) {
-            return res.status(400).json({ message: "Account record doesn't exist" });
-        }
+        if (!userOTPRecords) {}
 
         // OTP record exists
killedBy: verify_otp API Function should return a 400 error if OTP record does not exist for the provided email
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[Killed] ConditionalExpression
backend/controller/authentication.js:389:13
         // Find OTP records for the user by email
         const userOTPRecords = await Otp.findOne({ email : email });
 
-        if (!userOTPRecords) {
+        if (true) {
             return res.status(400).json({ message: "Account record doesn't exist" });
         }
killedBy: verify_otp API Function should return a 409 error if OTP has expired
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(409))

[Killed] ConditionalExpression
backend/controller/authentication.js:397:13
         const expiresAt = userOTPRecords.expiresAt;
         const existing_otp = userOTPRecords.otp;
 
-        if (expiresAt < Date.now()) {
+        if (true) {
             // OTP has expired
             await Otp.deleteMany({ email });
killedBy: verify_otp API Function should return a 401 error if OTP is incorrect
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Survived] EqualityOperator
backend/controller/authentication.js:397:13
         const expiresAt = userOTPRecords.expiresAt;
         const existing_otp = userOTPRecords.otp;
 
-        if (expiresAt < Date.now()) {
+        if (expiresAt <= Date.now()) {
             // OTP has expired
             await Otp.deleteMany({ email });

[Survived] ObjectLiteral
backend/controller/authentication.js:399:34
 
         if (expiresAt < Date.now()) {
             // OTP has expired
-            await Otp.deleteMany({ email });
+            await Otp.deleteMany({});
             return res.status(409).json({ message: "Code has expired. Please request again" });
         }

[Killed] StringLiteral
backend/controller/authentication.js:400:52
         if (expiresAt < Date.now()) {
             // OTP has expired
             await Otp.deleteMany({ email });
-            return res.status(409).json({ message: "Code has expired. Please request again" });
+            return res.status(409).json({ message: "" });
         }
 
killedBy: verify_otp API Function should return a 409 error if OTP has expired
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Code has expired. Please request again" }))

[Killed] ConditionalExpression
backend/controller/authentication.js:403:13
             return res.status(409).json({ message: "Code has expired. Please request again" });
         }
 
-        if (otp !== existing_otp) {
+        if (true) {
             return res.status(401).json({ message: "Invalid OTP. Please try again." });
         }
killedBy: verify_otp API Function should successfully change the password if OTP is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(200))

[Timeout] EqualityOperator
backend/controller/authentication.js:403:13
             return res.status(409).json({ message: "Code has expired. Please request again" });
         }
 
-        if (otp !== existing_otp) {
+        if (otp === existing_otp) {
             return res.status(401).json({ message: "Invalid OTP. Please try again." });
         }

[Killed] StringLiteral
backend/controller/authentication.js:404:52
         }
 
         if (otp !== existing_otp) {
-            return res.status(401).json({ message: "Invalid OTP. Please try again." });
+            return res.status(401).json({ message: "" });
         }
 
killedBy: verify_otp API Function should return a 401 error if OTP is incorrect
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Invalid OTP. Please try again." }))

[Killed] StringLiteral
backend/controller/authentication.js:413:22
         await Otp.deleteMany({ email });
 
         return res.status(200).json({
-            message: "Password changed successfully."
+            message: ""
         });
     } catch (error) {
killedBy: verify_otp API Function should successfully change the password if OTP is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Password changed successfully.' }))

[Killed] BooleanLiteral
backend/controller/authentication.js:425:13
     try {
         const { old_password, new_password } = req.body;
 
-        if (!old_password || !new_password) {
+        if (old_password || !new_password) {
             return res.status(400).json({message: "All fields are required" });
         }
killedBy: reset_password API Function should return a 409 error if the user does not exist
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(409))

[Killed] ConditionalExpression
backend/controller/authentication.js:425:13
     try {
         const { old_password, new_password } = req.body;
 
-        if (!old_password || !new_password) {
+        if (true) {
             return res.status(400).json({message: "All fields are required" });
         }
killedBy: reset_password API Function should return a 409 error if the user does not exist
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(409))

[Killed] ObjectLiteral
backend/controller/authentication.js:426:41
         const { old_password, new_password } = req.body;
 
         if (!old_password || !new_password) {
-            return res.status(400).json({message: "All fields are required" });
+            return res.status(400).json({});
         }
 
killedBy: reset_password API Function should return a 400 error if old or new password is missing
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "All fields are required" }))

[Killed] ConditionalExpression
backend/controller/authentication.js:436:13
         }
 
         // Check password length (e.g., minimum 8 characters)
-        if (new_password.length < 8) {
+        if (false) {
             return res.status(400).json({ message: 'Password must be at least 8 characters long.' });
         }
killedBy: reset_password API Function should return a 400 error if the new password is less than 8 characters
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Password must be at least 8 characters long." }))

[Killed] ConditionalExpression
backend/controller/authentication.js:436:13
         }
 
         // Check password length (e.g., minimum 8 characters)
-        if (new_password.length < 8) {
+        if (true) {
             return res.status(400).json({ message: 'Password must be at least 8 characters long.' });
         }
killedBy: reset_password API Function should return a 400 error if the old password is incorrect
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Incorrect Password" }))

[Killed] StringLiteral
backend/controller/authentication.js:437:52
 
         // Check password length (e.g., minimum 8 characters)
         if (new_password.length < 8) {
-            return res.status(400).json({ message: 'Password must be at least 8 characters long.' });
+            return res.status(400).json({ message: "" });
         }
         
killedBy: reset_password API Function should return a 400 error if the new password is less than 8 characters
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({ message: "Password must be at least 8 characters long." }))

[Killed] ConditionalExpression
backend/controller/authentication.js:441:12
         }
         
         const pass_hash = await bcrypt.compare(old_password, user.password);
-        if(!pass_hash){
+        if(false){
             return res.status(400).json({ message: 'Incorrect Password' });
         }
killedBy: reset_password API Function should return a 400 error if the old password is incorrect
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))

[Killed] BooleanLiteral
backend/controller/authentication.js:441:12
         }
         
         const pass_hash = await bcrypt.compare(old_password, user.password);
-        if(!pass_hash){
+        if(pass_hash){
             return res.status(400).json({ message: 'Incorrect Password' });
         }
killedBy: reset_password API Function should return a 400 error if the old password is incorrect
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(400))
