[NoCoverage] ConditionalExpression
backend/controller/exam.js:267:25
                     }
                 } else {
                     if (
-                        !question.desc ||
-                        !question.options ||
-                        question.points == null ||
-                        !question.difficulty ||
-                        question.answer == null
+                        true
                     ) {
                         return res

[NoCoverage] StringLiteral
backend/controller/exam.js:275:46
                     ) {
                         return res
                             .status(400)
-                            .json({ message: "Missing required fields for creating a question" });
+                            .json({ message: "" });
                     }
 

[NoCoverage] ObjectLiteral
backend/controller/exam.js:303:23
             console.log(err);
             return res
                 .status(400)
-                .json({ message: `Error creating questions: ${err.message}` });
+                .json({});
         }
 

[Survived] StringLiteral
backend/controller/exam.js:309:26
         const exam = await Exam.findOneAndUpdate(
             { examId },
             {
-                creator: `${examiner.firstname} ${examiner.lastname}`,
+                creator: ``,
                 creatorUsername: username,
                 questions: questionIds,

[Killed] ObjectLiteral
backend/controller/exam.js:327:19
         );
         return res
             .status(200)
-            .json({ message: "Exam updated successfully.", exam });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: update_exam API Function should update an exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: 'Exam updated successfully.',
  }))

[Killed] BlockStatement
backend/controller/exam.js:328:21
         return res
             .status(200)
             .json({ message: "Exam updated successfully.", exam });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: update_exam API Function should return 500 if there is a server error
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Timeout] BlockStatement
backend/controller/exam.js:339:24
     try {
         const username = req?.user?.username;
 
-        if (!username) {
-            return res.status(404).json({ message: "No Examiner Found" });
-        }
+        if (!username) {}
 
         const { examId } = req.params;

[Killed] BooleanLiteral
backend/controller/exam.js:348:12
         // Find the exam by ID and delete it
         const exam = await Exam.findOne({ examId });
 
-        if(!exam){
+        if(exam){
             return res.status(404).json({ message: "Exam not found"});
         }
killedBy: delete_exam API Function should return a 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ConditionalExpression
backend/controller/exam.js:348:12
         // Find the exam by ID and delete it
         const exam = await Exam.findOne({ examId });
 
-        if(!exam){
+        if(false){
             return res.status(404).json({ message: "Exam not found"});
         }
killedBy: delete_exam API Function should return a 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Survived] StringLiteral
backend/controller/exam.js:349:52
         const exam = await Exam.findOne({ examId });
 
         if(!exam){
-            return res.status(404).json({ message: "Exam not found"});
+            return res.status(404).json({ message: ""});
         }
 

[Survived] ObjectLiteral
backend/controller/exam.js:349:41
         const exam = await Exam.findOne({ examId });
 
         if(!exam){
-            return res.status(404).json({ message: "Exam not found"});
+            return res.status(404).json({});
         }
 

[Killed] EqualityOperator
backend/controller/exam.js:352:13
             return res.status(404).json({ message: "Exam not found"});
         }
 
-        if (exam.creatorUsername !== username) {
+        if (exam.creatorUsername === username) {
             return res
                 .status(401)
killedBy: delete_exam API Function should return a 401 if the user does not have access to delete the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] BlockStatement
backend/controller/exam.js:352:48
             return res.status(404).json({ message: "Exam not found"});
         }
 
-        if (exam.creatorUsername !== username) {
-            return res
-                .status(401)
-                .json({ message: "You have no access to delete this exam" });
-        }
+        if (exam.creatorUsername !== username) {}
 
         const startTime = new Date(exam.startTime);
killedBy: delete_exam API Function should return a 401 if the user does not have access to delete the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] StringLiteral
backend/controller/exam.js:355:34
         if (exam.creatorUsername !== username) {
             return res
                 .status(401)
-                .json({ message: "You have no access to delete this exam" });
+                .json({ message: "" });
         }
 
killedBy: delete_exam API Function should return a 401 if the user does not have access to delete the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "You have no access to delete this exam" }))

[Killed] ObjectLiteral
backend/controller/exam.js:355:23
         if (exam.creatorUsername !== username) {
             return res
                 .status(401)
-                .json({ message: "You have no access to delete this exam" });
+                .json({});
         }
 
killedBy: delete_exam API Function should return a 401 if the user does not have access to delete the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "You have no access to delete this exam" }))

[Killed] ConditionalExpression
backend/controller/exam.js:361:13
         const startTime = new Date(exam.startTime);
         const currentTime = new Date();
 
-        if (currentTime > startTime) {
+        if (true) {
             return res
                 .status(401)
killedBy: delete_exam API Function should delete the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.deleteOne.calledOnce)

[Killed] BlockStatement
backend/controller/exam.js:361:38
         const startTime = new Date(exam.startTime);
         const currentTime = new Date();
 
-        if (currentTime > startTime) {
-            return res
-                .status(401)
-                .json({
-                    message:
-                        "Exam Can not be deleted because it is already taken",
-                });
-        }
+        if (currentTime > startTime) {}
 
         if (!exam) {
killedBy: delete_exam API Function should return a 401 if the exam start time has passed
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(401))

[Killed] ConditionalExpression
backend/controller/exam.js:370:13
                 });
         }
 
-        if (!exam) {
+        if (true) {
             return res.status(404).json({ message: "Exam not found." });
         }
killedBy: delete_exam API Function should delete the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.deleteOne.calledOnce)

[NoCoverage] StringLiteral
backend/controller/exam.js:371:52
         }
 
         if (!exam) {
-            return res.status(404).json({ message: "Exam not found." });
+            return res.status(404).json({ message: "" });
         }
 

[Killed] BlockStatement
backend/controller/exam.js:378:21
         await exam.deleteOne();
 
         return res.status(200).json({ message: "Exam deleted successfully." });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] OptionalChaining
backend/controller/exam.js:389:26
     try {
         const { examId } = req.params; 
         const { questionId } = req.body; 
-        const username = req?.user?.username;
+        const username = req?.user.username;
 
         if (!username) {
killedBy: add_question_in_exam API Function should return a 404 if no examiner is found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Survived] OptionalChaining
backend/controller/exam.js:389:26
     try {
         const { examId } = req.params; 
         const { questionId } = req.body; 
-        const username = req?.user?.username;
+        const username = req.user?.username;
 
         if (!username) {

[Killed] StringLiteral
backend/controller/exam.js:392:52
         const username = req?.user?.username;
 
         if (!username) {
-            return res.status(404).json({ message: "No Examiner Found" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: add_question_in_exam API Function should return a 404 if no examiner is found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Examiner Found" }))

[Killed] ObjectLiteral
backend/controller/exam.js:392:41
         const username = req?.user?.username;
 
         if (!username) {
-            return res.status(404).json({ message: "No Examiner Found" });
+            return res.status(404).json({});
         }
 
killedBy: add_question_in_exam API Function should return a 404 if no examiner is found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Examiner Found" }))

[Survived] ObjectLiteral
backend/controller/exam.js:396:41
         }
 
         // Find the exam and update by pushing the new question to the questions array
-        const exam = await Exam.findOne({ examId: examId });
+        const exam = await Exam.findOne({});
 
         if (!exam) {

[Killed] BlockStatement
backend/controller/exam.js:398:20
         // Find the exam and update by pushing the new question to the questions array
         const exam = await Exam.findOne({ examId: examId });
 
-        if (!exam) {
-            return res.status(404).json({ message: "Exam not found" });
-        }
+        if (!exam) {}
 
         if (exam.creatorUsername !== username) {
killedBy: add_question_in_exam API Function should return a 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ConditionalExpression
backend/controller/exam.js:402:13
             return res.status(404).json({ message: "Exam not found" });
         }
 
-        if (exam.creatorUsername !== username) {
+        if (true) {
             return res
                 .status(401)
killedBy: add_question_in_exam API Function should return a 401 if the exam has already started or ended
statusReason: The expression evaluated to a falsy value:

  assert(
      res.json.calledWith({
          message: "Exam Can not be edited because it is already started/ended.",
      })
  )

[Timeout] ConditionalExpression
backend/controller/exam.js:402:13
             return res.status(404).json({ message: "Exam not found" });
         }
 
-        if (exam.creatorUsername !== username) {
+        if (false) {
             return res
                 .status(401)

[Killed] StringLiteral
backend/controller/exam.js:405:34
         if (exam.creatorUsername !== username) {
             return res
                 .status(401)
-                .json({ message: "Can't add question to someone else's exam" });
+                .json({ message: "" });
         }
 
killedBy: add_question_in_exam API Function should return a 401 if the user does not own the exam
statusReason: The expression evaluated to a falsy value:

  assert(
      res.json.calledWith({
          message: "Can't add question to someone else's exam",
      })
  )

[Timeout] EqualityOperator
backend/controller/exam.js:411:13
         const startTime = new Date(exam.startTime);
         const currentTime = new Date();
 
-        if (currentTime > startTime) {
+        if (currentTime <= startTime) {
             return res
                 .status(401)

[Survived] ObjectLiteral
backend/controller/exam.js:420:49
                 });
         }
 
-        const question = await Question.findOne({ questionId });
+        const question = await Question.findOne({});
 
         if (!question) {

[Killed] BlockStatement
backend/controller/exam.js:422:24
 
         const question = await Question.findOne({ questionId });
 
-        if (!question) {
-            return res.status(404).json({ message: "Question not found" });
-        }
+        if (!question) {}
         // Add the question to the exam's questions array
         if (!exam.questions.includes(questionId)) {
killedBy: add_question_in_exam API Function should return a 404 if the question is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ConditionalExpression
backend/controller/exam.js:422:13
 
         const question = await Question.findOne({ questionId });
 
-        if (!question) {
+        if (false) {
             return res.status(404).json({ message: "Question not found" });
         }
killedBy: add_question_in_exam API Function should return a 404 if the question is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] ObjectLiteral
backend/controller/exam.js:423:41
         const question = await Question.findOne({ questionId });
 
         if (!question) {
-            return res.status(404).json({ message: "Question not found" });
+            return res.status(404).json({});
         }
         // Add the question to the exam's questions array
killedBy: add_question_in_exam API Function should return a 404 if the question is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Question not found" }))

[Killed] BlockStatement
backend/controller/exam.js:426:51
             return res.status(404).json({ message: "Question not found" });
         }
         // Add the question to the exam's questions array
-        if (!exam.questions.includes(questionId)) {
-            exam.questions.push(questionId);
-            exam.total_points += question.points;
-            await exam.save();
-        }
+        if (!exam.questions.includes(questionId)) {}
 
         return res
killedBy: add_question_in_exam API Function should add a question to the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.save.calledOnce)

[Killed] ConditionalExpression
backend/controller/exam.js:426:13
             return res.status(404).json({ message: "Question not found" });
         }
         // Add the question to the exam's questions array
-        if (!exam.questions.includes(questionId)) {
+        if (false) {
             exam.questions.push(questionId);
             exam.total_points += question.points;
killedBy: add_question_in_exam API Function should add a question to the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.save.calledOnce)

[Killed] AssignmentOperator
backend/controller/exam.js:428:13
         // Add the question to the exam's questions array
         if (!exam.questions.includes(questionId)) {
             exam.questions.push(questionId);
-            exam.total_points += question.points;
+            exam.total_points -= question.points;
             await exam.save();
         }
killedBy: add_question_in_exam API Function should add a question to the exam successfully
statusReason: Expected values to be strictly equal:

-5 !== 5

[Killed] ObjectLiteral
backend/controller/exam.js:434:19
 
         return res
             .status(200)
-            .json({ message: "Question added to exam successfully", exam });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: add_question_in_exam API Function should add a question to the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(
      res.json.calledWithMatch({
          message: "Question added to exam successfully",
          exam: mockExam,
      })
  )

[Killed] StringLiteral
backend/controller/exam.js:434:30
 
         return res
             .status(200)
-            .json({ message: "Question added to exam successfully", exam });
+            .json({ message: "", exam });
     } catch (error) {
         console.log(error);
killedBy: add_question_in_exam API Function should add a question to the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(
      res.json.calledWithMatch({
          message: "Question added to exam successfully",
          exam: mockExam,
      })
  )

[Killed] BlockStatement
backend/controller/exam.js:435:21
         return res
             .status(200)
             .json({ message: "Question added to exam successfully", exam });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: add_question_in_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] OptionalChaining
backend/controller/exam.js:447:26
 export const delete_question_from_exam = async (req, res) => {
     try {
         const { examId, questionId } = req.params;
-        const username = req?.user?.username;
+        const username = req?.user.username;
 
         if (!username) {
killedBy: delete_question_from_exam API Function should return a 404 if no examiner is found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Survived] OptionalChaining
backend/controller/exam.js:447:26
 export const delete_question_from_exam = async (req, res) => {
     try {
         const { examId, questionId } = req.params;
-        const username = req?.user?.username;
+        const username = req.user?.username;
 
         if (!username) {

[Timeout] ConditionalExpression
backend/controller/exam.js:449:13
         const { examId, questionId } = req.params;
         const username = req?.user?.username;
 
-        if (!username) {
+        if (false) {
             return res.status(404).json({ message: "No Examiner Found" });
         }

[Killed] ConditionalExpression
backend/controller/exam.js:470:13
 
         const question = await Question.findOne({ questionId });
 
-        if (!question) {
+        if (true) {
             return res.status(404).json({ message: "Question not found" });
         }
killedBy: delete_question_from_exam API Function should remove the question from the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.save.calledOnce)

[Killed] BlockStatement
backend/controller/exam.js:476:35
 
         // Remove the question from the exam's questions array
         const questionIndex = exam.questions.indexOf(questionId);
-        if (questionIndex !== -1) {
-            exam.questions.splice(questionIndex, 1);
-            exam.total_points -= question.points;
-            await exam.save();
-        }
+        if (questionIndex !== -1) {}
 
         return res
killedBy: delete_question_from_exam API Function should remove the question from the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.save.calledOnce)

[Killed] EqualityOperator
backend/controller/exam.js:476:13
 
         // Remove the question from the exam's questions array
         const questionIndex = exam.questions.indexOf(questionId);
-        if (questionIndex !== -1) {
+        if (questionIndex === -1) {
             exam.questions.splice(questionIndex, 1);
             exam.total_points -= question.points;
killedBy: delete_question_from_exam API Function should remove the question from the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(mockExam.save.calledOnce)

[Killed] AssignmentOperator
backend/controller/exam.js:478:13
         const questionIndex = exam.questions.indexOf(questionId);
         if (questionIndex !== -1) {
             exam.questions.splice(questionIndex, 1);
-            exam.total_points -= question.points;
+            exam.total_points += question.points;
             await exam.save();
         }
killedBy: delete_question_from_exam API Function should remove the question from the exam successfully
statusReason: Expected values to be strictly equal:

20 !== 0

[Killed] StringLiteral
backend/controller/exam.js:484:30
 
         return res
             .status(200)
-            .json({ message: "Question removed from exam successfully", exam });
+            .json({ message: "", exam });
     } catch (error) {
         console.log(error);
killedBy: delete_question_from_exam API Function should remove the question from the exam successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question removed from exam successfully",
      exam: mockExam,
  }))

[Killed] BlockStatement
backend/controller/exam.js:485:21
         return res
             .status(200)
             .json({ message: "Question removed from exam successfully", exam });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_question_from_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] ObjectLiteral
backend/controller/exam.js:489:19
         console.log(error);
         return res
             .status(500)
-            .json({ message: error.message });
+            .json({});
     }
 };
killedBy: delete_question_from_exam API Function should return a 500 error if there is a server issue
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Database error" }))

[Killed] BlockStatement
backend/controller/exam.js:493:55
     }
 };
 
-export const fetch_exam_student = async (req, res) => {
-    try {
-        const { examId } = req.params;
-
-        // Find the exam by ID without fetching questions
-        const exam = await Exam.findOne({ examId }).lean();
-
-        if (!exam) {
-            return res.status(404).json({ message: "Exam not found" });
-        }
-
-        // Fetch all questions using their unique IDs
-        const questions = await Question.find({
-            questionId: { $in: exam.questions },
-        }).select("-answer");
-
-        return res.status(200).json({
-            message: "Exam Fetched Successfully",
-            exam: { ...exam, questions },
-        });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const fetch_exam_student = async (req, res) => {};
 
 export const fetch_exam_examiner = async (req, res) => {
killedBy: fetch_exam_student API Function should return a 500 error if there is a server issue while fetching the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Killed] BlockStatement
backend/controller/exam.js:494:9
 };
 
 export const fetch_exam_student = async (req, res) => {
-    try {
-        const { examId } = req.params;
-
-        // Find the exam by ID without fetching questions
-        const exam = await Exam.findOne({ examId }).lean();
-
-        if (!exam) {
-            return res.status(404).json({ message: "Exam not found" });
-        }
-
-        // Fetch all questions using their unique IDs
-        const questions = await Question.find({
-            questionId: { $in: exam.questions },
-        }).select("-answer");
-
-        return res.status(200).json({
-            message: "Exam Fetched Successfully",
-            exam: { ...exam, questions },
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: fetch_exam_student API Function should return a 500 error if there is a server issue while fetching the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[NoCoverage] ObjectLiteral
backend/controller/exam.js:509:37
             questionId: { $in: exam.questions },
         }).select("-answer");
 
-        return res.status(200).json({
-            message: "Exam Fetched Successfully",
-            exam: { ...exam, questions },
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/exam.js:513:21
             message: "Exam Fetched Successfully",
             exam: { ...exam, questions },
         });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: fetch_exam_student API Function should return a 500 error if there is a server issue while fetching the exam
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(500))

[Survived] ObjectLiteral
backend/controller/exam.js:530:41
         const { examId } = req.params;
 
         // Find the exam by ID without fetching questions
-        const exam = await Exam.findOne({ examId }).lean();
+        const exam = await Exam.findOne({}).lean();
         
         if (!exam || exam.creatorUsername !== username) {

[Killed] BlockStatement
backend/controller/exam.js:532:57
         // Find the exam by ID without fetching questions
         const exam = await Exam.findOne({ examId }).lean();
         
-        if (!exam || exam.creatorUsername !== username) {
-            return res.status(404).json({ message: "Exam not found." });
-        }
+        if (!exam || exam.creatorUsername !== username) {}
 
         // Fetch all questions using their unique IDs
killedBy: fetch_exam_examiner API Function should return a 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Killed] BooleanLiteral
backend/controller/exam.js:532:13
         // Find the exam by ID without fetching questions
         const exam = await Exam.findOne({ examId }).lean();
         
-        if (!exam || exam.creatorUsername !== username) {
+        if (exam || exam.creatorUsername !== username) {
             return res.status(404).json({ message: "Exam not found." });
         }
killedBy: fetch_exam_examiner API Function should return a 404 if the exam is not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledWith(404))

[Survived] ObjectLiteral
backend/controller/exam.js:537:47
         }
 
         // Fetch all questions using their unique IDs
-        const questions = await Question.find({
-            questionId: { $in: exam.questions },
-        });
+        const questions = await Question.find({});
 
         return res.status(200).json({

[Survived] ObjectLiteral
backend/controller/exam.js:538:25
 
         // Fetch all questions using their unique IDs
         const questions = await Question.find({
-            questionId: { $in: exam.questions },
+            questionId: {},
         });
 

[Killed] StringLiteral
backend/controller/exam.js:542:22
         });
 
         return res.status(200).json({
-            message: "Exam Fetched Successfully",
+            message: "",
             exam: { ...exam, questions },
         });
killedBy: fetch_exam_examiner API Function should fetch the exam and its questions successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Exam Fetched Successfully",
      exam: {
          examId: 1,
          creatorUsername: "examinerUsername",
          questions: [
