[Killed] BlockStatement
backend/controller/examiner.js:4:50
 import User from "../models/user.js";
 import Examiner from '../models/examiner.js'
 
-export const all_examiners = async (req, res) => {
-    try{
-        const examiners = await User.find({role: "Examiner"}).select("-password");
-
-        if(!examiners){
-            return res.status(404).json({message: "No Examiners Found"});
-        }
-
-        return res.status(200).json({ examiners: examiners, message: "Examiners fetched successfully"});
-    } catch(error){
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const all_examiners = async (req, res) => {};
 
 export const delete_examiner = async (req, res) => {
killedBy: all_examiners API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] BlockStatement
backend/controller/examiner.js:5:8
 import Examiner from '../models/examiner.js'
 
 export const all_examiners = async (req, res) => {
-    try{
-        const examiners = await User.find({role: "Examiner"}).select("-password");
-
-        if(!examiners){
-            return res.status(404).json({message: "No Examiners Found"});
-        }
-
-        return res.status(200).json({ examiners: examiners, message: "Examiners fetched successfully"});
-    } catch(error){
+    try{} catch(error){
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: all_examiners API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Survived] ObjectLiteral
backend/controller/examiner.js:6:43
 
 export const all_examiners = async (req, res) => {
     try{
-        const examiners = await User.find({role: "Examiner"}).select("-password");
+        const examiners = await User.find({}).select("-password");
 
         if(!examiners){

[NoCoverage] BlockStatement
backend/controller/examiner.js:8:23
     try{
         const examiners = await User.find({role: "Examiner"}).select("-password");
 
-        if(!examiners){
-            return res.status(404).json({message: "No Examiners Found"});
-        }
+        if(!examiners){}
 
         return res.status(200).json({ examiners: examiners, message: "Examiners fetched successfully"});

[NoCoverage] BooleanLiteral
backend/controller/examiner.js:8:12
     try{
         const examiners = await User.find({role: "Examiner"}).select("-password");
 
-        if(!examiners){
+        if(examiners){
             return res.status(404).json({message: "No Examiners Found"});
         }

[NoCoverage] ObjectLiteral
backend/controller/examiner.js:9:41
         const examiners = await User.find({role: "Examiner"}).select("-password");
 
         if(!examiners){
-            return res.status(404).json({message: "No Examiners Found"});
+            return res.status(404).json({});
         }
 

[NoCoverage] ObjectLiteral
backend/controller/examiner.js:12:37
             return res.status(404).json({message: "No Examiners Found"});
         }
 
-        return res.status(200).json({ examiners: examiners, message: "Examiners fetched successfully"});
+        return res.status(200).json({});
     } catch(error){
         console.log(error);

[Killed] BlockStatement
backend/controller/examiner.js:13:19
         }
 
         return res.status(200).json({ examiners: examiners, message: "Examiners fetched successfully"});
-    } catch(error){
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch(error){}
 };
 
killedBy: all_examiners API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] BlockStatement
backend/controller/examiner.js:20:9
 };
 
 export const delete_examiner = async (req, res) => {
-    try {
-        const { username } = req.params; 
-
-        const user = await User.findOne({ username: username });
-
-        if (!user) {
-            return res.status(404).json({ message: "User not found." });
-        }
-
-        const examiner = await Examiner.findOne({ username });
-
-        if (!examiner) {
-            return res.status(404).json({ message: "Examiner not found." });
-        }
-
-        await Examiner.deleteOne({ _id: examiner._id });
-
-        await User.deleteOne({ username: username });
-
-        return res.status(200).json({ message: "Examiner and associated User deleted successfully." });
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: delete_examiner API Function should delete an examiner and associated user successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] BlockStatement
backend/controller/examiner.js:31:24
 
         const examiner = await Examiner.findOne({ username });
 
-        if (!examiner) {
-            return res.status(404).json({ message: "Examiner not found." });
-        }
+        if (!examiner) {}
 
         await Examiner.deleteOne({ _id: examiner._id });
killedBy: delete_examiner API Function should handle examiner not found
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] ObjectLiteral
backend/controller/examiner.js:37:30
 
         await Examiner.deleteOne({ _id: examiner._id });
 
-        await User.deleteOne({ username: username });
+        await User.deleteOne({});
 
         return res.status(200).json({ message: "Examiner and associated User deleted successfully." });
killedBy: delete_examiner API Function should delete an examiner and associated user successfully
statusReason: The expression evaluated to a falsy value:

  assert(deleteUserStub.calledOnceWith({ username: "testuser" }))

[Killed] ObjectLiteral
backend/controller/examiner.js:39:37
 
         await User.deleteOne({ username: username });
 
-        return res.status(200).json({ message: "Examiner and associated User deleted successfully." });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);
killedBy: delete_examiner API Function should delete an examiner and associated user successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Examiner and associated User deleted successfully." }))

[Killed] BlockStatement
backend/controller/examiner.js:40:21
         await User.deleteOne({ username: username });
 
         return res.status(200).json({ message: "Examiner and associated User deleted successfully." });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_examiner API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] ConditionalExpression
backend/controller/examiner.js:50:12
     try{
         const { username } = req.params;
 
-        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Student"){
+        if(true){
             return res.status(400).json({ message: 'Unathorized Access' });
         }
killedBy: get_examiner API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Timeout] BlockStatement
backend/controller/examiner.js:50:105
     try{
         const { username } = req.params;
 
-        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Student"){
-            return res.status(400).json({ message: 'Unathorized Access' });
-        }
+        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Student"){}
 
         const user = await User.findOne({ username }).select("-password");

[Killed] StringLiteral
backend/controller/examiner.js:51:52
         const { username } = req.params;
 
         if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Student"){
-            return res.status(400).json({ message: 'Unathorized Access' });
+            return res.status(400).json({ message: "" });
         }
 
killedBy: get_examiner API Function should handle unauthorized access for non-admin users
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Unathorized Access" }))

[Survived] ObjectLiteral
backend/controller/examiner.js:54:41
             return res.status(400).json({ message: 'Unathorized Access' });
         }
 
-        const user = await User.findOne({ username }).select("-password");
+        const user = await User.findOne({}).select("-password");
 
         if(!user){

[NoCoverage] BlockStatement
backend/controller/examiner.js:56:18
 
         const user = await User.findOne({ username }).select("-password");
 
-        if(!user){
-            return res.status(404).json({message: "Examiner not found"});
-        }
+        if(!user){}
 
         const formatDate = (date) => {

[NoCoverage] StringLiteral
backend/controller/examiner.js:57:51
         const user = await User.findOne({ username }).select("-password");
 
         if(!user){
-            return res.status(404).json({message: "Examiner not found"});
+            return res.status(404).json({message: ""});
         }
 

[NoCoverage] ObjectLiteral
backend/controller/examiner.js:57:41
         const user = await User.findOne({ username }).select("-password");
 
         if(!user){
-            return res.status(404).json({message: "Examiner not found"});
+            return res.status(404).json({});
         }
 

[NoCoverage] BlockStatement
backend/controller/examiner.js:60:38
             return res.status(404).json({message: "Examiner not found"});
         }
 
-        const formatDate = (date) => {
-            const year = date.getFullYear();
-            const month = String(date.getMonth() + 1).padStart(2, '0'); // Add leading zero
-            const day = String(date.getDate()).padStart(2, '0');        // Add leading zero
-          
-            return `${year}-${month}-${day}`;
-        };
+        const formatDate = (date) => {};
 
         const response = {

[NoCoverage] ArithmeticOperator
backend/controller/examiner.js:62:34
 
         const formatDate = (date) => {
             const year = date.getFullYear();
-            const month = String(date.getMonth() + 1).padStart(2, '0'); // Add leading zero
+            const month = String(date.getMonth() - 1).padStart(2, '0'); // Add leading zero
             const day = String(date.getDate()).padStart(2, '0');        // Add leading zero
           

[NoCoverage] ObjectLiteral
backend/controller/examiner.js:79:37
         };
         
 
-        return res.status(200).json({user: response, message: "Profile Fetched Successfully"});
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/examiner.js:80:21
         
 
         return res.status(200).json({user: response, message: "Profile Fetched Successfully"});
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: get_examiner API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] BooleanLiteral
backend/controller/examiner.js:91:39
         const { username } = req.params;  
         const { firstname, lastname, middlename, dob, mobileno, gender, email } = req.body;
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender){
+        if(!username || !firstname || lastname || !dob || !mobileno || !email || !gender){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] BooleanLiteral
backend/controller/examiner.js:91:60
         const { username } = req.params;  
         const { firstname, lastname, middlename, dob, mobileno, gender, email } = req.body;
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender){
+        if(!username || !firstname || !lastname || !dob || mobileno || !email || !gender){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] Regex
backend/controller/examiner.js:95:31
             return res.status(400).json({ message: 'All fields are required!' });
         }
 
-        const mobilenoRegex = /^\d{10}$/;
+        const mobilenoRegex = /^\D{10}$/;
         if (!mobilenoRegex.test(mobileno)) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Survived] Regex
backend/controller/examiner.js:95:31
             return res.status(400).json({ message: 'All fields are required!' });
         }
 
-        const mobilenoRegex = /^\d{10}$/;
+        const mobilenoRegex = /\d{10}$/;
         if (!mobilenoRegex.test(mobileno)) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });

[Killed] BooleanLiteral
backend/controller/examiner.js:96:13
         }
 
         const mobilenoRegex = /^\d{10}$/;
-        if (!mobilenoRegex.test(mobileno)) {
+        if (mobilenoRegex.test(mobileno)) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ConditionalExpression
backend/controller/examiner.js:96:13
         }
 
         const mobilenoRegex = /^\d{10}$/;
-        if (!mobilenoRegex.test(mobileno)) {
+        if (true) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] Regex
backend/controller/examiner.js:100:26
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
 
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\d{4}-\d{2}-\d$/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] Regex
backend/controller/examiner.js:100:26
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
 
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\d{4}-\d{2}-\D{2}$/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ConditionalExpression
backend/controller/examiner.js:101:13
         }
 
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
-        if (!dobRegex.test(dob)) {
+        if (true) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] BooleanLiteral
backend/controller/examiner.js:101:13
         }
 
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
-        if (!dobRegex.test(dob)) {
+        if (dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[NoCoverage] ObjectLiteral
backend/controller/examiner.js:102:41
 
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
         if (!dobRegex.test(dob)) {
-            return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
+            return res.status(400).json({});
         }
 

[Killed] Regex
backend/controller/examiner.js:106:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]+@[^\s@]\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] Regex
backend/controller/examiner.js:106:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\s@]@[^\s@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] BooleanLiteral
backend/controller/examiner.js:107:13
 
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-        if (!emailRegex.test(email)) {
+        if (emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ConditionalExpression
backend/controller/examiner.js:107:13
 
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-        if (!emailRegex.test(email)) {
+        if (true) {
             return res.status(400).json({ message: 'Invalid email format.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ArithmeticOperator
backend/controller/examiner.js:112:37
         }
 
         const [year, month, day] = dob.split('-').map(Number);
-        const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
+        const date = new Date(year, month + 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ConditionalExpression
backend/controller/examiner.js:115:13
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if (true) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] EqualityOperator
backend/controller/examiner.js:115:77
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() === day) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
killedBy: update_profile API Function should update the user profile successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] StringLiteral
backend/controller/examiner.js:116:52
 
         // Check for valid day, month, and year in dob
         if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
-            return res.status(400).json({ message: 'Invalid date of birth values.' });
+            return res.status(400).json({ message: "" });
         }
 
killedBy: update_profile API Function should return 400 if date of birth format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Invalid date of birth values." }))

[Killed] ObjectLiteral
backend/controller/examiner.js:122:41
         const user = await User.findOne({ username: username });
 
         if (!user) {
-            return res.status(404).json({ message: "User not found." });
+            return res.status(404).json({});
         }
 
killedBy: update_profile API Function should return 404 if user not found
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "User not found." }))

[Survived] ConditionalExpression
backend/controller/examiner.js:125:13
             return res.status(404).json({ message: "User not found." });
         }
 
-        if (firstname) user.firstname = firstname;
+        if (false) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;

[Survived] ConditionalExpression
backend/controller/examiner.js:125:13
             return res.status(404).json({ message: "User not found." });
         }
 
-        if (firstname) user.firstname = firstname;
+        if (true) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;

[Survived] ConditionalExpression
backend/controller/examiner.js:126:13
         }
 
         if (firstname) user.firstname = firstname;
-        if (lastname) user.lastname = lastname;
+        if (true) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;

[Survived] ConditionalExpression
backend/controller/examiner.js:126:13
         }
 
         if (firstname) user.firstname = firstname;
-        if (lastname) user.lastname = lastname;
+        if (false) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;

[Survived] ConditionalExpression
backend/controller/examiner.js:127:13
 
         if (firstname) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
-        if (middlename) user.middlename = middlename;
+        if (false) user.middlename = middlename;
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;

[Survived] ConditionalExpression
backend/controller/examiner.js:127:13
 
         if (firstname) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
-        if (middlename) user.middlename = middlename;
+        if (true) user.middlename = middlename;
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;

[Survived] ConditionalExpression
backend/controller/examiner.js:128:13
         if (firstname) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
-        if (dob) user.dob = date;
+        if (true) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
         if (gender) user.gender = gender;

[Survived] ConditionalExpression
backend/controller/examiner.js:128:13
         if (firstname) user.firstname = firstname;
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
-        if (dob) user.dob = date;
+        if (false) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
         if (gender) user.gender = gender;

[Survived] ConditionalExpression
backend/controller/examiner.js:129:13
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;
-        if (mobileno) user.mobileno = mobileno;
+        if (false) user.mobileno = mobileno;
         if (gender) user.gender = gender;
         if (email) user.email = email;

[Survived] ConditionalExpression
backend/controller/examiner.js:129:13
         if (lastname) user.lastname = lastname;
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;
-        if (mobileno) user.mobileno = mobileno;
+        if (true) user.mobileno = mobileno;
         if (gender) user.gender = gender;
         if (email) user.email = email;

[Survived] ConditionalExpression
backend/controller/examiner.js:130:13
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
-        if (gender) user.gender = gender;
+        if (true) user.gender = gender;
         if (email) user.email = email;
 

[Survived] ConditionalExpression
backend/controller/examiner.js:130:13
         if (middlename) user.middlename = middlename;
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
-        if (gender) user.gender = gender;
+        if (false) user.gender = gender;
         if (email) user.email = email;
 

[Survived] ConditionalExpression
backend/controller/examiner.js:131:13
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
         if (gender) user.gender = gender;
-        if (email) user.email = email;
+        if (false) user.email = email;
 
         await user.save();

[Survived] ConditionalExpression
backend/controller/examiner.js:131:13
         if (dob) user.dob = date;
         if (mobileno) user.mobileno = mobileno;
         if (gender) user.gender = gender;
-        if (email) user.email = email;
+        if (true) user.email = email;
 
         await user.save();

[Survived] StringLiteral
backend/controller/examiner.js:135:48
 
         await user.save();
 
-        return res.status(200).json({ message: "Profile updated successfully.", user });
+        return res.status(200).json({ message: "", user });
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/examiner.js:136:21
         await user.save();
 
         return res.status(200).json({ message: "Profile updated successfully.", user });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
killedBy: update_profile API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))
