[Timeout] BlockStatement
backend/controller/exams_result.js:9:24
     try {
         const username = req?.user?.username; 
 
-        if (!username) {
-            return res.status(404).json({ message: "No username found" });
-        }
+        if (!username) {}
 
         const student = await Student.findOne({ username }).populate({

[Survived] ObjectLiteral
backend/controller/exams_result.js:13:47
             return res.status(404).json({ message: "No username found" });
         }
 
-        const student = await Student.findOne({ username }).populate({
+        const student = await Student.findOne({}).populate({
             path: 'givenExams.exam',
             select: 'examId total_points title subject' 

[NoCoverage] StringLiteral
backend/controller/exams_result.js:14:19
         }
 
         const student = await Student.findOne({ username }).populate({
-            path: 'givenExams.exam',
+            path: "",
             select: 'examId total_points title subject' 
         });

[NoCoverage] BlockStatement
backend/controller/exams_result.js:18:23
             select: 'examId total_points title subject' 
         });
 
-        if (!student) {
-            return res.status(404).json({ message: 'Student not found' });
-        }
+        if (!student) {}
 
         const results = [];

[NoCoverage] ConditionalExpression
backend/controller/exams_result.js:18:13
             select: 'examId total_points title subject' 
         });
 
-        if (!student) {
+        if (false) {
             return res.status(404).json({ message: 'Student not found' });
         }

[NoCoverage] StringLiteral
backend/controller/exams_result.js:19:52
         });
 
         if (!student) {
-            return res.status(404).json({ message: 'Student not found' });
+            return res.status(404).json({ message: "" });
         }
 

[NoCoverage] ArrayDeclaration
backend/controller/exams_result.js:22:25
             return res.status(404).json({ message: 'Student not found' });
         }
 
-        const results = [];
+        const results = ["Stryker was here"];
 
         for (const examEntry of student.givenExams) {

[NoCoverage] BlockStatement
backend/controller/exams_result.js:24:53
 
         const results = [];
 
-        for (const examEntry of student.givenExams) {
-            const exam = examEntry.exam;
-
-            const percentage = (examEntry.obtained_score / exam.total_points) * 100;
-
-            results.push({
-                examId: exam.examId,
-                title: exam.title,
-                subject: exam.subject,
-                totalPoints: exam.total_points,
-                obtainedPoints: examEntry.obtained_score,
-                percentage
-            });
-            
-        }
+        for (const examEntry of student.givenExams) {}
 
         return res.status(200).json({ message: "Results Fetched Successfully", pastExams: results});

[NoCoverage] ArithmeticOperator
backend/controller/exams_result.js:27:32
         for (const examEntry of student.givenExams) {
             const exam = examEntry.exam;
 
-            const percentage = (examEntry.obtained_score / exam.total_points) * 100;
+            const percentage = examEntry.obtained_score / exam.total_points / 100;
 
             results.push({

[NoCoverage] ArithmeticOperator
backend/controller/exams_result.js:27:33
         for (const examEntry of student.givenExams) {
             const exam = examEntry.exam;
 
-            const percentage = (examEntry.obtained_score / exam.total_points) * 100;
+            const percentage = (examEntry.obtained_score * exam.total_points) * 100;
 
             results.push({

[NoCoverage] ObjectLiteral
backend/controller/exams_result.js:40:37
             
         }
 
-        return res.status(200).json({ message: "Results Fetched Successfully", pastExams: results});
+        return res.status(200).json({});
 
     } catch (error) {

[Killed] BlockStatement
backend/controller/exams_result.js:42:21
 
         return res.status(200).json({ message: "Results Fetched Successfully", pastExams: results});
 
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: exams_result API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] ConditionalExpression
backend/controller/exams_result.js:57:13
             return res.status(404).json({ message: "No username found" });
         }
 
-        if (!examId) {
+        if (true) {
             return res.status(404).json({ message: "No Exam found" });
         }
killedBy: show_exam API Function should handle server errors gracefully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Timeout] BooleanLiteral
backend/controller/exams_result.js:57:13
             return res.status(404).json({ message: "No username found" });
         }
 
-        if (!examId) {
+        if (examId) {
             return res.status(404).json({ message: "No Exam found" });
         }

[NoCoverage] StringLiteral
backend/controller/exams_result.js:68:23
                 select: 'examId title' 
             })
             .populate({
-                path: 'givenExams.questions.question', 
+                path: "", 
                 select: 'questionId desc options answer' 
             });

[NoCoverage] StringLiteral
backend/controller/exams_result.js:69:25
             })
             .populate({
                 path: 'givenExams.questions.question', 
-                select: 'questionId desc options answer' 
+                select: "" 
             });
 

[NoCoverage] ConditionalExpression
backend/controller/exams_result.js:72:13
                 select: 'questionId desc options answer' 
             });
 
-        if (!student) {
+        if (true) {
             return res.status(404).json({ message: 'Student not found' });
         }

[NoCoverage] OptionalChaining
backend/controller/exams_result.js:76:54
             return res.status(404).json({ message: 'Student not found' });
         }
 
-        const exam = student.givenExams.find(exam => exam?.exam?.examId === parseInt(examId));
+        const exam = student.givenExams.find(exam => exam.exam?.examId === parseInt(examId));
 
         if (!exam) {

[NoCoverage] OptionalChaining
backend/controller/exams_result.js:76:54
             return res.status(404).json({ message: 'Student not found' });
         }
 
-        const exam = student.givenExams.find(exam => exam?.exam?.examId === parseInt(examId));
+        const exam = student.givenExams.find(exam => exam?.exam.examId === parseInt(examId));
 
         if (!exam) {

[NoCoverage] BlockStatement
backend/controller/exams_result.js:78:20
 
         const exam = student.givenExams.find(exam => exam?.exam?.examId === parseInt(examId));
 
-        if (!exam) {
-            return res.status(404).json({ message: 'Exam not found for this student' });
-        }
+        if (!exam) {}
 
         const questionDetails = [];

[NoCoverage] BlockStatement
backend/controller/exams_result.js:84:53
 
         const questionDetails = [];
 
-        for (const questionEntry of exam.questions) {
-            const question = questionEntry.question; 
-            const selectedAnswer = questionEntry.answer;  
-            const correctAnswer = question.answer;  
-
-            questionDetails.push({
-                questionId: question.questionId,
-                description: question.desc,
-                options: question.options,
-                selectedAnswer,
-                correctAnswer,
-            });
-        }
+        for (const questionEntry of exam.questions) {}
 
         return res.status(200).json({

[NoCoverage] ObjectLiteral
backend/controller/exams_result.js:89:34
             const selectedAnswer = questionEntry.answer;  
             const correctAnswer = question.answer;  
 
-            questionDetails.push({
-                questionId: question.questionId,
-                description: question.desc,
-                options: question.options,
-                selectedAnswer,
-                correctAnswer,
-            });
+            questionDetails.push({});
         }
 

[Timeout] BlockStatement
backend/controller/exams_result.js:115:22
     try {
         const { examId } = req.params;
 
-        if (!examId) {
-            return res.status(400).json({ message: "Exam ID is required" });
-        }
+        if (!examId) {}
 
         const exam = await Exam.findOne({ examId });

[Survived] ObjectLiteral
backend/controller/exams_result.js:119:41
             return res.status(400).json({ message: "Exam ID is required" });
         }
 
-        const exam = await Exam.findOne({ examId });
+        const exam = await Exam.findOne({});
 
         if (!exam) {

[NoCoverage] StringLiteral
backend/controller/exams_result.js:125:78
             return res.status(404).json({ message: "Exam not found" });
         }
 
-        const students = await Student.find({ "givenExams.exam": exam._id }, "username givenExams batch")
+        const students = await Student.find({ "givenExams.exam": exam._id }, "")
             .populate("givenExams.exam");
 

[NoCoverage] ConditionalExpression
backend/controller/exams_result.js:128:13
         const students = await Student.find({ "givenExams.exam": exam._id }, "username givenExams batch")
             .populate("givenExams.exam");
 
-        if (students.length === 0) {
+        if (false) {
             return res.status(404).json({ message: "No students have attempted this exam" });
         }

[NoCoverage] BlockStatement
backend/controller/exams_result.js:128:36
         const students = await Student.find({ "givenExams.exam": exam._id }, "username givenExams batch")
             .populate("givenExams.exam");
 
-        if (students.length === 0) {
-            return res.status(404).json({ message: "No students have attempted this exam" });
-        }
+        if (students.length === 0) {}
 
         const results = await Promise.all(students.map(async (student) => {

[NoCoverage] BlockStatement
backend/controller/exams_result.js:132:75
             return res.status(404).json({ message: "No students have attempted this exam" });
         }
 
-        const results = await Promise.all(students.map(async (student) => {
-            const examData = student.givenExams.find((e) => e.exam._id.equals(exam._id));
-
-
-            const user = await User.findOne({ username: student.username });
-
-            return {
-                username: student.username,
-                name: `${user.firstname} ${user.lastname}`,
-                batch: student.batch,
-                obtainedPoints: examData.obtained_score,
-                totalPoints: examData.exam.total_points || 0, 
-            };
-        }));
+        const results = await Promise.all(students.map(async (student) => {}));
 
         // Sort results by obtained points in descending order

[NoCoverage] ArrowFunction
backend/controller/exams_result.js:133:54
         }
 
         const results = await Promise.all(students.map(async (student) => {
-            const examData = student.givenExams.find((e) => e.exam._id.equals(exam._id));
+            const examData = student.givenExams.find(() => undefined);
 
 

[NoCoverage] ObjectLiteral
backend/controller/exams_result.js:136:45
             const examData = student.givenExams.find((e) => e.exam._id.equals(exam._id));
 
 
-            const user = await User.findOne({ username: student.username });
+            const user = await User.findOne({});
 
             return {

[NoCoverage] LogicalOperator
backend/controller/exams_result.js:143:30
                 name: `${user.firstname} ${user.lastname}`,
                 batch: student.batch,
                 obtainedPoints: examData.obtained_score,
-                totalPoints: examData.exam.total_points || 0, 
+                totalPoints: examData.exam.total_points && 0, 
             };
         }));

[NoCoverage] ConditionalExpression
backend/controller/exams_result.js:143:30
                 name: `${user.firstname} ${user.lastname}`,
                 batch: student.batch,
                 obtainedPoints: examData.obtained_score,
-                totalPoints: examData.exam.total_points || 0, 
+                totalPoints: true, 
             };
         }));

[NoCoverage] ArrowFunction
backend/controller/exams_result.js:148:22
         }));
 
         // Sort results by obtained points in descending order
-        results.sort((a, b) => b.obtainedPoints - a.obtainedPoints);
+        results.sort(() => undefined);
 
         return res.status(200).json({ message: "Student Data fetched successfully", results });

[NoCoverage] MethodExpression
backend/controller/exams_result.js:148:9
         }));
 
         // Sort results by obtained points in descending order
-        results.sort((a, b) => b.obtainedPoints - a.obtainedPoints);
+        results;
 
         return res.status(200).json({ message: "Student Data fetched successfully", results });

[NoCoverage] ObjectLiteral
backend/controller/exams_result.js:150:37
         // Sort results by obtained points in descending order
         results.sort((a, b) => b.obtainedPoints - a.obtainedPoints);
 
-        return res.status(200).json({ message: "Student Data fetched successfully", results });
+        return res.status(200).json({});
 
     } catch (error) {

[NoCoverage] StringLiteral
backend/controller/exams_result.js:150:48
         // Sort results by obtained points in descending order
         results.sort((a, b) => b.obtainedPoints - a.obtainedPoints);
 
-        return res.status(200).json({ message: "Student Data fetched successfully", results });
+        return res.status(200).json({ message: "", results });
 
     } catch (error) {
