[Killed] BlockStatement
backend/controller/past_upcoming_exams.js:8:9
 import Question from "../models/question.js";
 
 export const get_past_exams = async (req, res) => {
-    try {
-        const currentTime = new Date();
-
-        // Fetch exams that have ended (startTime + duration < currentTime)
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-        });
-
-        return res
-            .status(200)
-            .json({ message: "Past exams retrieved successfully.", pastExams });
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res
killedBy: get_past_exams API Function should retrieve past exams successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Survived] ArrayDeclaration
backend/controller/past_upcoming_exams.js:18:42
                     {
                         $add: [
                             "$startTime",
-                            { $multiply: ["$duration", 60000] },
+                            { $multiply: [] },
                         ],
                     },

[Survived] StringLiteral
backend/controller/past_upcoming_exams.js:24:21
                     currentTime,
                 ],
             },
-            status: "Published",
+            status: "",
         });
 

[Killed] BlockStatement
backend/controller/past_upcoming_exams.js:30:21
         return res
             .status(200)
             .json({ message: "Past exams retrieved successfully.", pastExams });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: get_past_exams API Function should return 500 if there is a server error
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Survived] ObjectLiteral
backend/controller/past_upcoming_exams.js:47:21
         const upcomingExams = await Exam.find({
             $expr: {
                 $gt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
+                    {},
                     currentTime,
                 ],

[Survived] ArrayDeclaration
backend/controller/past_upcoming_exams.js:48:31
             $expr: {
                 $gt: [
                     {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
+                        $add: [],
                     },
                     currentTime,

[Survived] ObjectLiteral
backend/controller/past_upcoming_exams.js:50:29
                     {
                         $add: [
                             "$startTime",
-                            { $multiply: ["$duration", 60000] },
+                            {},
                         ],
                     },

[Killed] BlockStatement
backend/controller/past_upcoming_exams.js:65:21
                 message: "Upcoming exams retrieved successfully.",
                 upcomingExams,
             });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: get_upcoming_exams API Function should return 500 if there is a server error
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Survived] ObjectLiteral
backend/controller/past_upcoming_exams.js:82:47
             return res.status(404).json({ message: "No Username Found" });
         }
 
-        const student = await Student.findOne({ username });
+        const student = await Student.findOne({});
 
         if (!student) {

[Killed] BlockStatement
backend/controller/past_upcoming_exams.js:84:23
 
         const student = await Student.findOne({ username });
 
-        if (!student) {
-            return res.status(404).json({ message: "No Student Found" });
-        }
+        if (!student) {}
 
         const currentTime = new Date();
killedBy: get_upcoming_exams_5_student API Function should return 404 if no student is found for the given username
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] BooleanLiteral
backend/controller/past_upcoming_exams.js:84:13
 
         const student = await Student.findOne({ username });
 
-        if (!student) {
+        if (student) {
             return res.status(404).json({ message: "No Student Found" });
         }
killedBy: get_upcoming_exams_5_student API Function should return 404 if no student is found for the given username
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] StringLiteral
backend/controller/past_upcoming_exams.js:85:52
         const student = await Student.findOne({ username });
 
         if (!student) {
-            return res.status(404).json({ message: "No Student Found" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: get_upcoming_exams_5_student API Function should return 404 if no student is found for the given username
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledOnceWith({ message: "No Student Found" }))

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:91:37
         const currentTime = new Date();
 
         // Fetch only 5 exams with a startTime in the future (startTime > currentTime)
-        const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-            batch: student.batch,
-            branch: student.branch,
-        })
-            .sort({ startTime: 1 }) // Sort by startTime in ascending order
+        const upcomingExams = await Exam.find({
+  $expr: {
+    $gt: [{
+      $add: ["$startTime", {
+        $multiply: ["$duration", 60000]
+      }]
+    }, currentTime]
+  },
+  status: "Published",
+  batch: student.batch,
+  branch: student.branch
+}) // Sort by startTime in ascending order
             .limit(5)
             .select("-questions"); // Limit to 5 results

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:91:47
         const currentTime = new Date();
 
         // Fetch only 5 exams with a startTime in the future (startTime > currentTime)
-        const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-            batch: student.batch,
-            branch: student.branch,
-        })
+        const upcomingExams = await Exam.find({})
             .sort({ startTime: 1 }) // Sort by startTime in ascending order
             .limit(5)

[NoCoverage] ArrayDeclaration
backend/controller/past_upcoming_exams.js:93:22
         // Fetch only 5 exams with a startTime in the future (startTime > currentTime)
         const upcomingExams = await Exam.find({
             $expr: {
-                $gt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
+                $gt: [],
             },
             status: "Published",

[Timeout] BlockStatement
backend/controller/past_upcoming_exams.js:129:24
     try {
         const username = req?.user?.username;
 
-        if (!username) {
-            return res.status(404).json({ message: "No Username Found" });
-        }
+        if (!username) {}
 
         const student = await Student.findOne({ username });

[Killed] ObjectLiteral
backend/controller/past_upcoming_exams.js:136:41
         const student = await Student.findOne({ username });
 
         if (!student) {
-            return res.status(404).json({ message: "No Student Found" });
+            return res.status(404).json({});
         }
 
killedBy: get_past_exams_5_student API Function should return 404 if no student found for the username
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledOnceWith({message: "No Student Found"}))

[Killed] MethodExpression
backend/controller/past_upcoming_exams.js:143:33
         const currentYear = currentTime.getFullYear();
 
         // Fetch exams that have ended and are within the current year
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-            batch: student.batch,
-            branch: student.branch,
-        })
-            .sort({ startTime: -1 })
+        const pastExams = await Exam.find({
+  $expr: {
+    $lt: [{
+      $add: ["$startTime", {
+        $multiply: ["$duration", 60000]
+      }]
+    }, currentTime]
+  },
+  status: "Published",
+  batch: student.batch,
+  branch: student.branch
+})
             .limit(5); // Sort by startTime in descending order
 
killedBy: get_past_exams_5_student API Function should return 200 and past exams if successful
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Survived] StringLiteral
backend/controller/past_upcoming_exams.js:149:43
                     {
                         $add: [
                             "$startTime",
-                            { $multiply: ["$duration", 60000] },
+                            { $multiply: ["", 60000] },
                         ],
                     },

[Survived] UnaryOperator
backend/controller/past_upcoming_exams.js:159:32
             batch: student.batch,
             branch: student.branch,
         })
-            .sort({ startTime: -1 })
+            .sort({ startTime: +1 })
             .limit(5); // Sort by startTime in descending order
 

[Killed] ObjectLiteral
backend/controller/past_upcoming_exams.js:164:19
 
         return res
             .status(200)
-            .json({ message: "Past exams retrieved successfully.", pastExams });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: get_past_exams_5_student API Function should return 200 and past exams if successful
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledOnceWith({
      message: "Past exams retrieved successfully.",
      pastExams,
  }))

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:191:20
 
         // Fetch exams with a startTime in the future  (startTime > currentTime)
         const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
+            $expr: {},
             status: "Published",
             batch: student.batch,

[NoCoverage] StringLiteral
backend/controller/past_upcoming_exams.js:195:29
                 $gt: [
                     {
                         $add: [
-                            "$startTime",
+                            "",
                             { $multiply: ["$duration", 60000] },
                         ],

[NoCoverage] BlockStatement
backend/controller/past_upcoming_exams.js:207:38
             branch: student.branch,
         }).select("-questions");
 
-        upcomingExams.sort((a, b) => {
-            const dateA = new Date(a.startTime);
-            const dateB = new Date(b.startTime);
-            return dateA - dateB; // Ascending order
-        });
+        upcomingExams.sort((a, b) => {});
 
         return res

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:207:9
             branch: student.branch,
         }).select("-questions");
 
-        upcomingExams.sort((a, b) => {
-            const dateA = new Date(a.startTime);
-            const dateB = new Date(b.startTime);
-            return dateA - dateB; // Ascending order
-        });
+        upcomingExams;
 
         return res

[NoCoverage] ArithmeticOperator
backend/controller/past_upcoming_exams.js:210:20
         upcomingExams.sort((a, b) => {
             const dateA = new Date(a.startTime);
             const dateB = new Date(b.startTime);
-            return dateA - dateB; // Ascending order
+            return dateA + dateB; // Ascending order
         });
 

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:215:19
 
         return res
             .status(200)
-            .json({
-                message: "Upcoming exams retrieved successfully.",
-                upcomingExams,
-            });
+            .json({});
     } catch (error) {
         console.log(error);

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:235:49
             return res.status(404).json({ message: "No Username Found" });
         }
 
-        const examiner = await Examiner.findOne({ username });
+        const examiner = await Examiner.findOne({});
 
         if (!examiner) {

[NoCoverage] BooleanLiteral
backend/controller/past_upcoming_exams.js:237:13
 
         const examiner = await Examiner.findOne({ username });
 
-        if (!examiner) {
+        if (examiner) {
             return res.status(404).json({ message: "No examiner Found" });
         }

[NoCoverage] BlockStatement
backend/controller/past_upcoming_exams.js:237:24
 
         const examiner = await Examiner.findOne({ username });
 
-        if (!examiner) {
-            return res.status(404).json({ message: "No examiner Found" });
-        }
+        if (!examiner) {}
 
         const currentTime = new Date();

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:244:37
         const currentTime = new Date();
 
         // Fetch only 5 exams with a startTime in the future (startTime > currentTime)
-        const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    "$startTime",
-                    currentTime,
-                ],
-            },
-            status: "Published",
-        })
-            .sort({ startTime: 1 }) // Sort by startTime in ascending order
+        const upcomingExams = await Exam.find({
+  $expr: {
+    $gt: ["$startTime", currentTime]
+  },
+  status: "Published"
+}) // Sort by startTime in ascending order
             .limit(5)
             .select("-questions"); // Limit to 5 results

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:244:47
         const currentTime = new Date();
 
         // Fetch only 5 exams with a startTime in the future (startTime > currentTime)
-        const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    "$startTime",
-                    currentTime,
-                ],
-            },
-            status: "Published",
-        })
+        const upcomingExams = await Exam.find({})
             .sort({ startTime: 1 }) // Sort by startTime in ascending order
             .limit(5)

[NoCoverage] StringLiteral
backend/controller/past_upcoming_exams.js:247:21
         const upcomingExams = await Exam.find({
             $expr: {
                 $gt: [
-                    "$startTime",
+                    "",
                     currentTime,
                 ],

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:276:41
         const username = req?.user?.username;
 
         if (!username) {
-            return res.status(404).json({ message: "No Username Found" });
+            return res.status(404).json({});
         }
 

[NoCoverage] StringLiteral
backend/controller/past_upcoming_exams.js:282:52
         const examiner = await Examiner.findOne({ username });
 
         if (!examiner) {
-            return res.status(404).json({ message: "No examiner Found" });
+            return res.status(404).json({ message: "" });
         }
 

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:288:33
         const currentTime = new Date();
 
         // Fetch exams that have ended and are within the current year
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-        })
-            .sort({ startTime: -1 })
+        const pastExams = await Exam.find({
+  $expr: {
+    $lt: [{
+      $add: ["$startTime", {
+        $multiply: ["$duration", 60000]
+      }]
+    }, currentTime]
+  },
+  status: "Published"
+})
             .limit(5); // Sort by startTime in descending order
 

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:288:43
         const currentTime = new Date();
 
         // Fetch exams that have ended and are within the current year
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-        })
+        const pastExams = await Exam.find({})
             .sort({ startTime: -1 })
             .limit(5); // Sort by startTime in descending order

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:289:20
 
         // Fetch exams that have ended and are within the current year
         const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
+            $expr: {},
             status: "Published",
         })

[NoCoverage] ArrayDeclaration
backend/controller/past_upcoming_exams.js:290:22
         // Fetch exams that have ended and are within the current year
         const pastExams = await Exam.find({
             $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
+                $lt: [],
             },
             status: "Published",

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:333:37
         const currentTime = new Date();
 
         // Fetch exams with a startTime in the future  (startTime > currentTime)
-        const upcomingExams = await Exam.find({
-            $expr: {
-                $gt: [
-                    "$startTime",
-                    currentTime,
-                ],
-            },
-            creatorUsername: username
-        }).sort({ startTime: -1 }).lean();
+        const upcomingExams = await Exam.find({
+  $expr: {
+    $gt: ["$startTime", currentTime]
+  },
+  creatorUsername: username
+}).lean();
 
         const upcomingExamsQuestions = await Promise.all(

[NoCoverage] ArrayDeclaration
backend/controller/past_upcoming_exams.js:335:22
         // Fetch exams with a startTime in the future  (startTime > currentTime)
         const upcomingExams = await Exam.find({
             $expr: {
-                $gt: [
-                    "$startTime",
-                    currentTime,
-                ],
+                $gt: [],
             },
             creatorUsername: username

[NoCoverage] UnaryOperator
backend/controller/past_upcoming_exams.js:341:30
                 ],
             },
             creatorUsername: username
-        }).sort({ startTime: -1 }).lean();
+        }).sort({ startTime: +1 }).lean();
 
         const upcomingExamsQuestions = await Promise.all(

[NoCoverage] BlockStatement
backend/controller/past_upcoming_exams.js:344:47
         }).sort({ startTime: -1 }).lean();
 
         const upcomingExamsQuestions = await Promise.all(
-            upcomingExams.map(async (exam) => {
-                // Fetch the questions for this exam
-                const questions = await Question.find({ questionId: { $in: exam.questions } }).lean();
-
-                return {
-                    ...exam,
-                    questions, // Attach full question details
-                };
-            })
+            upcomingExams.map(async (exam) => {})
         );
 

[NoCoverage] ObjectLiteral
backend/controller/past_upcoming_exams.js:357:19
 
         return res
             .status(200)
-            .json({
-                message: "Upcoming exams retrieved successfully.",
-                upcomingExams:upcomingExamsQuestions,
-            });
+            .json({});
     } catch (error) {
         console.log(error);

[NoCoverage] StringLiteral
backend/controller/past_upcoming_exams.js:358:26
         return res
             .status(200)
             .json({
-                message: "Upcoming exams retrieved successfully.",
+                message: "",
                 upcomingExams:upcomingExamsQuestions,
             });

[NoCoverage] MethodExpression
backend/controller/past_upcoming_exams.js:386:33
         const currentTime = new Date();
 
         // Fetch exams with a startTime in the future  (startTime > currentTime)
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-            creatorUsername: username
-        }).sort({ startTime: -1 }).lean();
+        const pastExams = await Exam.find({
+  $expr: {
+    $lt: [{
+      $add: ["$startTime", {
+        $multiply: ["$duration", 60000]
+      }]
+    }, currentTime]
+  },
+  status: "Published",
+  creatorUsername: username
+}).lean();
 
         const pastExamsQuestions = await Promise.all(

[NoCoverage] BlockStatement
backend/controller/past_upcoming_exams.js:403:43
         }).sort({ startTime: -1 }).lean();
 
         const pastExamsQuestions = await Promise.all(
-            pastExams.map(async (exam) => {
-                // Fetch the questions for this exam
-                const questions = await Question.find({ questionId: { $in: exam.questions } }).lean();
-
-                return {
-                    ...exam,
-                    questions, // Attach full question details
-                };
-            })
+            pastExams.map(async (exam) => {})
         );
 

[NoCoverage] StringLiteral
backend/controller/past_upcoming_exams.js:417:26
         return res
             .status(200)
             .json({
-                message: "Past exams retrieved successfully.",
+                message: "",
                 pastExams:pastExamsQuestions,
             });
