[Survived] OptionalChaining
backend/controller/questions.js:10:26
 export const create_question = async (req, res) => {
     try {
 
-        const username = req?.user?.username;
+        const username = req?.user.username;
 
         if (!username) {

[Survived] OptionalChaining
backend/controller/questions.js:10:26
 export const create_question = async (req, res) => {
     try {
 
-        const username = req?.user?.username;
+        const username = req.user?.username;
 
         if (!username) {

[Killed] BlockStatement
backend/controller/questions.js:19:45
         const { desc, options, points, difficulty, answer, subject } =
             req.body;
 
-        if (!options || options.length < 2) {
-            return res
-                .status(400)
-                .json({ message: "At least two options are required." });
-        }
+        if (!options || options.length < 2) {}
 
         const examiner = await User.findOne({ username });
killedBy: create_question API Function should return 400 if options are not provided or have less than 2
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] LogicalOperator
backend/controller/questions.js:19:13
         const { desc, options, points, difficulty, answer, subject } =
             req.body;
 
-        if (!options || options.length < 2) {
+        if (!options && options.length < 2) {
             return res
                 .status(400)
killedBy: create_question API Function should return 400 if options are not provided or have less than 2
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] ObjectLiteral
backend/controller/questions.js:22:23
         if (!options || options.length < 2) {
             return res
                 .status(400)
-                .json({ message: "At least two options are required." });
+                .json({});
         }
 
killedBy: create_question API Function should return 400 if options are not provided or have less than 2
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "At least two options are required." }))

[Killed] StringLiteral
backend/controller/questions.js:22:34
         if (!options || options.length < 2) {
             return res
                 .status(400)
-                .json({ message: "At least two options are required." });
+                .json({ message: "" });
         }
 
killedBy: create_question API Function should return 400 if options are not provided or have less than 2
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "At least two options are required." }))

[Survived] ObjectLiteral
backend/controller/questions.js:25:45
                 .json({ message: "At least two options are required." });
         }
 
-        const examiner = await User.findOne({ username });
+        const examiner = await User.findOne({});
 
         if (!examiner) {

[Killed] ObjectLiteral
backend/controller/questions.js:28:41
         const examiner = await User.findOne({ username });
 
         if (!examiner) {
-            return res.status(404).json({ message: "No Student Found" });
+            return res.status(404).json({});
         }
 
killedBy: create_question API Function should return 404 if examiner is not found in the database
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Student Found" }))

[Survived] StringLiteral
backend/controller/questions.js:37:21
             options,
             creatorUsername:username,
             points,
-            creator:`${examiner.firstname} ${examiner.lastname}`,
+            creator:``,
             difficulty,
             answer,

[Survived] StringLiteral
backend/controller/questions.js:48:30
 
         return res
             .status(200)
-            .json({ message: "Question created successfully.", question });
+            .json({ message: "", question });
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/questions.js:49:21
         return res
             .status(200)
             .json({ message: "Question created successfully.", question });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: create_question API Function should return 500 if there is an error during the process
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] LogicalOperator
backend/controller/questions.js:75:13
             return res.status(404).json({ message: "No Student Found" });
         }
 
-        if (options && options.length < 2) {
+        if (options || options.length < 2) {
             return res
                 .status(400)
killedBy: update_question API Function should return 404 if the question is not found or does not belong to the examiner
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] ConditionalExpression
backend/controller/questions.js:75:24
             return res.status(404).json({ message: "No Student Found" });
         }
 
-        if (options && options.length < 2) {
+        if (options && true) {
             return res
                 .status(400)
killedBy: update_question API Function should return 404 if the question is not found or does not belong to the examiner
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] BlockStatement
backend/controller/questions.js:85:65
         const question = await Question.findOne({ questionId: id });
 
         // If the question is not found, return a 404 error
-        if (!question || question.creatorUsername !== username) {
-            return res.status(404).json({ message: "Question not found." });
-        }
+        if (!question || question.creatorUsername !== username) {}
 
         // Update the fields of the question
killedBy: update_question API Function should return 404 if the question is not found or does not belong to the examiner
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] BooleanLiteral
backend/controller/questions.js:85:13
         const question = await Question.findOne({ questionId: id });
 
         // If the question is not found, return a 404 error
-        if (!question || question.creatorUsername !== username) {
+        if (question || question.creatorUsername !== username) {
             return res.status(404).json({ message: "Question not found." });
         }
killedBy: update_question API Function should return 404 if the question is not found or does not belong to the examiner
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] LogicalOperator
backend/controller/questions.js:90:25
         }
 
         // Update the fields of the question
-        question.desc = desc || question.desc;
+        question.desc = desc && question.desc;
         question.options = options || question.options;
         question.points = points || question.points;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:90:25
         }
 
         // Update the fields of the question
-        question.desc = desc || question.desc;
+        question.desc = true;
         question.options = options || question.options;
         question.points = points || question.points;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:91:28
 
         // Update the fields of the question
         question.desc = desc || question.desc;
-        question.options = options || question.options;
+        question.options = true;
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:91:28
 
         // Update the fields of the question
         question.desc = desc || question.desc;
-        question.options = options || question.options;
+        question.options = false;
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:92:27
         // Update the fields of the question
         question.desc = desc || question.desc;
         question.options = options || question.options;
-        question.points = points || question.points;
+        question.points = false;
         question.difficulty = difficulty || question.difficulty;
         question.answer = answer || question.answer;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] LogicalOperator
backend/controller/questions.js:92:27
         // Update the fields of the question
         question.desc = desc || question.desc;
         question.options = options || question.options;
-        question.points = points || question.points;
+        question.points = points && question.points;
         question.difficulty = difficulty || question.difficulty;
         question.answer = answer || question.answer;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] LogicalOperator
backend/controller/questions.js:93:31
         question.desc = desc || question.desc;
         question.options = options || question.options;
         question.points = points || question.points;
-        question.difficulty = difficulty || question.difficulty;
+        question.difficulty = difficulty && question.difficulty;
         question.answer = answer || question.answer;
         question.subject = subject || question.subject;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:93:31
         question.desc = desc || question.desc;
         question.options = options || question.options;
         question.points = points || question.points;
-        question.difficulty = difficulty || question.difficulty;
+        question.difficulty = true;
         question.answer = answer || question.answer;
         question.subject = subject || question.subject;
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:94:27
         question.options = options || question.options;
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
-        question.answer = answer || question.answer;
+        question.answer = true;
         question.subject = subject || question.subject;
 
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:94:27
         question.options = options || question.options;
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
-        question.answer = answer || question.answer;
+        question.answer = false;
         question.subject = subject || question.subject;
 
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ConditionalExpression
backend/controller/questions.js:95:28
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
         question.answer = answer || question.answer;
-        question.subject = subject || question.subject;
+        question.subject = true;
 
         // Save the updated question
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] LogicalOperator
backend/controller/questions.js:95:28
         question.points = points || question.points;
         question.difficulty = difficulty || question.difficulty;
         question.answer = answer || question.answer;
-        question.subject = subject || question.subject;
+        question.subject = subject && question.subject;
 
         // Save the updated question
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] ObjectLiteral
backend/controller/questions.js:102:19
 
         return res
             .status(200)
-            .json({ message: "Question updated successfully.", question });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: update_question API Function should return 200 and the updated question if everything is valid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWithMatch({
      message: "Question updated successfully.",
      question: updatedQuestionMock,
  }))

[Killed] BlockStatement
backend/controller/questions.js:103:21
         return res
             .status(200)
             .json({ message: "Question updated successfully.", question });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: update_question API Function should return 500 if there is an error during the process
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] StringLiteral
backend/controller/questions.js:122:52
         const examiner = await User.findOne({ username });
 
         if (!examiner) {
-            return res.status(404).json({ message: "No Student Found" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: delete_question API Function should return 404 if examiner is not found in the database
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Student Found" }))

[Survived] ObjectLiteral
backend/controller/questions.js:128:49
         const { id } = req.params; // ID of the question to delete
 
         // Find the question by ID and delete it
-        const question = await Question.findOne({ questionId: id }); // Use findOne with _id filter
+        const question = await Question.findOne({}); // Use findOne with _id filter
 
         if (!question || question.creatorUsername !== username) {

[Killed] ConditionalExpression
backend/controller/questions.js:130:13
         // Find the question by ID and delete it
         const question = await Question.findOne({ questionId: id }); // Use findOne with _id filter
 
-        if (!question || question.creatorUsername !== username) {
+        if (false) {
             return res.status(404).json({ message: "Question not found." });
         }
killedBy: delete_question API Function should return 404 if the question is not found or the examiner is not the creator
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] LogicalOperator
backend/controller/questions.js:130:13
         // Find the question by ID and delete it
         const question = await Question.findOne({ questionId: id }); // Use findOne with _id filter
 
-        if (!question || question.creatorUsername !== username) {
+        if (!question && question.creatorUsername !== username) {
             return res.status(404).json({ message: "Question not found." });
         }
killedBy: delete_question API Function should return 404 if the question is not found or the examiner is not the creator
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[Killed] StringLiteral
backend/controller/questions.js:131:52
         const question = await Question.findOne({ questionId: id }); // Use findOne with _id filter
 
         if (!question || question.creatorUsername !== username) {
-            return res.status(404).json({ message: "Question not found." });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: delete_question API Function should return 404 if the question is not found or the examiner is not the creator
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "Question not found." }))

[Killed] BlockStatement
backend/controller/questions.js:140:21
         return res
             .status(200)
             .json({ message: "Question deleted successfully." });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_question API Function should return 500 if there is an error during the process
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] StringLiteral
backend/controller/questions.js:152:52
         const username = req?.user?.username;
 
         if (!username) {
-            return res.status(404).json({ message: "No Username Found" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: all_questions_subject_wise_student API Function should return 404 if no username found in request
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Username Found" }))

[Killed] ObjectLiteral
backend/controller/questions.js:164:43
         const currentTime = new Date();
 
         // Fetch exams that have ended (startTime + duration < currentTime)
-        const pastExams = await Exam.find({
-            $expr: {
-                $lt: [
-                    {
-                        $add: [
-                            "$startTime",
-                            { $multiply: ["$duration", 60000] },
-                        ],
-                    },
-                    currentTime,
-                ],
-            },
-            status: "Published",
-            batch: student.batch,
-            branch: student.branch,
-        });
+        const pastExams = await Exam.find({});
 
         // Extract and flatten questionIds from past exams
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ArrowFunction
backend/controller/questions.js:183:42
 
         // Extract and flatten questionIds from past exams
         const questionIds = [
-            ...new Set(pastExams.flatMap((exam) => exam.questions)),
+            ...new Set(pastExams.flatMap(() => undefined)),
         ];
 
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ArrayDeclaration
backend/controller/questions.js:187:59
         ];
 
         // Fetch and group questions by subject for the unique questionIds
-        const groupedQuestions = await Question.aggregate([
-            {
-                $match: {
-                    questionId: { $in: questionIds }, // Filter questions by unique questionIds
-                },
-            },
-            {
-                $group: {
-                    _id: "$subject", // Group by the subject field
-                    questions: { $push: "$$ROOT" }, // Push the entire question document into the array
-                },
-            },
-            {
-                $project: {
-                    _id: 0, // Remove the _id field from the output
-                    subject: "$_id", // Rename _id to subject
-                    questions: 1, // Keep the questions array
-                },
-            },
-        ]);
+        const groupedQuestions = await Question.aggregate([]);
 
         return res
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ObjectLiteral
backend/controller/questions.js:199:13
                     questions: { $push: "$$ROOT" }, // Push the entire question document into the array
                 },
             },
-            {
-                $project: {
-                    _id: 0, // Remove the _id field from the output
-                    subject: "$_id", // Rename _id to subject
-                    questions: 1, // Keep the questions array
-                },
-            },
+            {},
         ]);
 
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ObjectLiteral
backend/controller/questions.js:200:27
                 },
             },
             {
-                $project: {
-                    _id: 0, // Remove the _id field from the output
-                    subject: "$_id", // Rename _id to subject
-                    questions: 1, // Keep the questions array
-                },
+                $project: {},
             },
         ]);
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ObjectLiteral
backend/controller/questions.js:210:19
 
         return res
             .status(200)
-            .json({
-                message: "Questions retrieved successfully.",
-                groupedQuestions,
-            });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: all_questions_subject_wise_student API Function should return 200 and the grouped questions if everything is valid
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BooleanLiteral
backend/controller/questions.js:227:13
     try {
         const { questionId } = req.body;
 
-        if (!questionId) {
+        if (questionId) {
             return res.status(404).json({ message: "No Question Found" });
         }
killedBy: add_question_bookmark_student API Function should return 404 if no questionId is provided
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Question Found" }))

[Killed] ConditionalExpression
backend/controller/questions.js:227:13
     try {
         const { questionId } = req.body;
 
-        if (!questionId) {
+        if (false) {
             return res.status(404).json({ message: "No Question Found" });
         }
killedBy: add_question_bookmark_student API Function should return 404 if no questionId is provided
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Question Found" }))

[Killed] BlockStatement
backend/controller/questions.js:250:21
         return res
             .status(200)
             .json({ message: "Question bookmarked successfully." });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: add_question_bookmark_student API Function should return 500 if there is an error during the process
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] StringLiteral
backend/controller/questions.js:264:52
         const { questionId } = req.body;
 
         if (!questionId) {
-            return res.status(404).json({ message: "No Question Found" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: delete_question_bookmark_student API Function should return 404 if no questionId is provided
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Question Found" }))

[Killed] ObjectLiteral
backend/controller/questions.js:264:41
         const { questionId } = req.body;
 
         if (!questionId) {
-            return res.status(404).json({ message: "No Question Found" });
+            return res.status(404).json({});
         }
 
killedBy: delete_question_bookmark_student API Function should return 404 if no questionId is provided
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: "No Question Found" }))

[Killed] EqualityOperator
backend/controller/questions.js:284:13
             { $pull: { bookmarkedQuestions: questionId } } 
         );
 
-        if (result.modifiedCount === 0) {
+        if (result.modifiedCount !== 0) {
             return res
                 .status(404)
killedBy: delete_question_bookmark_student API Function should return 404 if the question is not found or already removed
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/questions.js:284:13
             { $pull: { bookmarkedQuestions: questionId } } 
         );
 
-        if (result.modifiedCount === 0) {
+        if (true) {
             return res
                 .status(404)
killedBy: delete_question_bookmark_student API Function should return 404 if the question is not found or already removed
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] StringLiteral
backend/controller/questions.js:287:34
         if (result.modifiedCount === 0) {
             return res
                 .status(404)
-                .json({ message: "Question not found or already removed." });
+                .json({ message: "" });
         }
 
killedBy: delete_question_bookmark_student API Function should return 404 if the question is not found or already removed
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ObjectLiteral
backend/controller/questions.js:292:19
 
         return res
             .status(200)
-            .json({ message: "Question unbookmarked successfully." });
+            .json({});
     } catch (error) {
         console.log(error);
killedBy: delete_question_bookmark_student API Function should return 200 and successfully unbookmark the question
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BlockStatement
backend/controller/questions.js:293:21
         return res
             .status(200)
             .json({ message: "Question unbookmarked successfully." });
-    } catch (error) {
-        console.log(error);
-        return res
-            .status(500)
-            .json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_question_bookmark_student API Function should return 500 if there is an error during the process
statusReason: Attempted to wrap findOne which is already wrapped
