[Killed] BlockStatement
backend/controller/questions.js:303:9
 
 // get all questions examiner
 export const all_questions_examiner = async (req, res) => {
-    try {
-        const username = req?.user?.username;
-
-        if (!username) {
-            return res.status(404).json({ message: "No Examiner Found" });
-        }
-
-        const examiner = await User.findOne({ username });
-
-        if (!examiner) {
-            return res.status(404).json({ message: "No Student Found" });
-        }
-
-        const questions = await Question.find({
-            creatorUsername: username
-        }).lean();
-
-        return res
-            .status(200)
-            .json({
-                message: "Questions retrieved successfully.",
-                questions,
-            });
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res
killedBy: all_questions_examiner API Function should return 404 if no username is provided in the request
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(404))

[NoCoverage] ObjectLiteral
backend/controller/questions.js:316:47
             return res.status(404).json({ message: "No Student Found" });
         }
 
-        const questions = await Question.find({
-            creatorUsername: username
-        }).lean();
+        const questions = await Question.find({}).lean();
 
         return res
