[Killed] ObjectLiteral
backend/controller/student.js:15:47
             return res.status(404).json({ message: "No Username Found" });
         }
 
-        const student = await Student.findOne({ username: username })
+        const student = await Student.findOne({})
             .populate({
                 path: 'givenExams.exam',
killedBy: student_performance API Function should return 500 if there is an error during the process; student_performance API Function should return 500 if there is an error during the process
statusReason: Attempted to wrap findOne which is already wrapped

[NoCoverage] StringLiteral
backend/controller/student.js:17:23
 
         const student = await Student.findOne({ username: username })
             .populate({
-                path: 'givenExams.exam',
+                path: "",
                 select: 'total_points'
             });

[NoCoverage] StringLiteral
backend/controller/student.js:18:25
         const student = await Student.findOne({ username: username })
             .populate({
                 path: 'givenExams.exam',
-                select: 'total_points'
+                select: ""
             });
 

[NoCoverage] ObjectLiteral
backend/controller/student.js:22:41
             });
 
         if (!student) {
-            return res.status(404).json({ message: "Student not found" });
+            return res.status(404).json({});
         }
 

[NoCoverage] ConditionalExpression
backend/controller/student.js:29:12
         let totalPointsEarned = 0;
 
         // Iterate through each exam
-        if(student?.givenExams && student.givenExams)
+        if(false)
         student.givenExams.forEach((examRecord) => {
             totalPointsPossible += examRecord.exam.total_points;

[NoCoverage] LogicalOperator
backend/controller/student.js:29:12
         let totalPointsEarned = 0;
 
         // Iterate through each exam
-        if(student?.givenExams && student.givenExams)
+        if(student?.givenExams || student.givenExams)
         student.givenExams.forEach((examRecord) => {
             totalPointsPossible += examRecord.exam.total_points;

[NoCoverage] BlockStatement
backend/controller/student.js:30:52
 
         // Iterate through each exam
         if(student?.givenExams && student.givenExams)
-        student.givenExams.forEach((examRecord) => {
-            totalPointsPossible += examRecord.exam.total_points;
-
-            totalPointsEarned += examRecord.obtained_score;
-        });
+        student.givenExams.forEach((examRecord) => {});
 
         // Calculate performance percentage

[NoCoverage] AssignmentOperator
backend/controller/student.js:31:13
         // Iterate through each exam
         if(student?.givenExams && student.givenExams)
         student.givenExams.forEach((examRecord) => {
-            totalPointsPossible += examRecord.exam.total_points;
+            totalPointsPossible -= examRecord.exam.total_points;
 
             totalPointsEarned += examRecord.obtained_score;

[NoCoverage] AssignmentOperator
backend/controller/student.js:33:13
         student.givenExams.forEach((examRecord) => {
             totalPointsPossible += examRecord.exam.total_points;
 
-            totalPointsEarned += examRecord.obtained_score;
+            totalPointsEarned -= examRecord.obtained_score;
         });
 

[NoCoverage] ConditionalExpression
backend/controller/student.js:37:28
         });
 
         // Calculate performance percentage
-        const percentage = totalPointsPossible > 0 
+        const percentage = false 
             ? (totalPointsEarned / totalPointsPossible) * 100 
             : 0;

[NoCoverage] EqualityOperator
backend/controller/student.js:37:28
         });
 
         // Calculate performance percentage
-        const percentage = totalPointsPossible > 0 
+        const percentage = totalPointsPossible >= 0 
             ? (totalPointsEarned / totalPointsPossible) * 100 
             : 0;

[NoCoverage] ArithmeticOperator
backend/controller/student.js:38:16
 
         // Calculate performance percentage
         const percentage = totalPointsPossible > 0 
-            ? (totalPointsEarned / totalPointsPossible) * 100 
+            ? (totalPointsEarned * totalPointsPossible) * 100 
             : 0;
 

[NoCoverage] ArithmeticOperator
backend/controller/student.js:38:15
 
         // Calculate performance percentage
         const percentage = totalPointsPossible > 0 
-            ? (totalPointsEarned / totalPointsPossible) * 100 
+            ? totalPointsEarned / totalPointsPossible / 100 
             : 0;
 

[NoCoverage] ObjectLiteral
backend/controller/student.js:42:25
             : 0;
 
         // Send response
-        return res.json({
-            totalPointsPossible,
-            totalPointsEarned,
-            percentage: percentage.toFixed(2) + "%"
-        });
+        return res.json({});
     } catch (error) {
         console.log(error);

[Killed] ConditionalExpression
backend/controller/student.js:65:13
 
         // Fetch student, question, and exam data
         const student = await Student.findOne({ username });
-        if (!student) {
+        if (false) {
             return res.status(404).json({ message: "Student not found" });
         }
killedBy: student_submit_answer API Function should return 404 if student is not found in the database; student_submit_answer API Function should return 404 if student is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BooleanLiteral
backend/controller/student.js:65:13
 
         // Fetch student, question, and exam data
         const student = await Student.findOne({ username });
-        if (!student) {
+        if (student) {
             return res.status(404).json({ message: "Student not found" });
         }
killedBy: student_submit_answer API Function should return 404 if student is not found in the database; student_submit_answer API Function should return 404 if student is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:70:13
         }
 
         const question = await Question.findOne({ questionId }); // Corrected query
-        if (!question) {
+        if (false) {
             return res.status(404).json({ message: "Question not found" });
         }
killedBy: student_submit_answer API Function should return 404 if question is not found in the database; student_submit_answer API Function should return 404 if question is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BooleanLiteral
backend/controller/student.js:70:13
         }
 
         const question = await Question.findOne({ questionId }); // Corrected query
-        if (!question) {
+        if (question) {
             return res.status(404).json({ message: "Question not found" });
         }
killedBy: student_submit_answer API Function should return 404 if question is not found in the database; student_submit_answer API Function should return 404 if question is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:75:13
         }
 
         const examData = await Exam.findOne({ examId }); // Corrected query
-        if (!examData) {
+        if (false) {
             return res.status(404).json({ message: "Exam not found" });
         }
killedBy: student_submit_answer API Function should return 404 if exam is not found in the database; student_submit_answer API Function should return 404 if exam is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BooleanLiteral
backend/controller/student.js:75:13
         }
 
         const examData = await Exam.findOne({ examId }); // Corrected query
-        if (!examData) {
+        if (examData) {
             return res.status(404).json({ message: "Exam not found" });
         }
killedBy: student_submit_answer API Function should return 404 if exam is not found in the database; student_submit_answer API Function should return 404 if exam is not found in the database
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] EqualityOperator
backend/controller/student.js:79:12
             return res.status(404).json({ message: "Exam not found" });
         }
 
-        if(examData.batch !== student.batch || examData.branch !== student.branch){
+        if(examData.batch === student.batch || examData.branch !== student.branch){
             return res.status(404).json({ message: "Exam is not for your batch/branch" });
         }
killedBy: student_submit_answer API Function should return 404 if exam is not for the correct batch/branch; student_submit_answer API Function should return 404 if exam is not for the correct batch/branch
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] EqualityOperator
backend/controller/student.js:79:48
             return res.status(404).json({ message: "Exam not found" });
         }
 
-        if(examData.batch !== student.batch || examData.branch !== student.branch){
+        if(examData.batch !== student.batch || examData.branch === student.branch){
             return res.status(404).json({ message: "Exam is not for your batch/branch" });
         }
killedBy: student_submit_answer API Function should return 401 if exam is not started or already ended; student_submit_answer API Function should return 401 if exam is not started or already ended
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] StringLiteral
backend/controller/student.js:80:52
         }
 
         if(examData.batch !== student.batch || examData.branch !== student.branch){
-            return res.status(404).json({ message: "Exam is not for your batch/branch" });
+            return res.status(404).json({ message: "" });
         }
 
killedBy: student_submit_answer API Function should return 404 if exam is not for the correct batch/branch; student_submit_answer API Function should return 404 if exam is not for the correct batch/branch
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ObjectLiteral
backend/controller/student.js:80:41
         }
 
         if(examData.batch !== student.batch || examData.branch !== student.branch){
-            return res.status(404).json({ message: "Exam is not for your batch/branch" });
+            return res.status(404).json({});
         }
 
killedBy: student_submit_answer API Function should return 404 if exam is not for the correct batch/branch; student_submit_answer API Function should return 404 if exam is not for the correct batch/branch
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ArithmeticOperator
backend/controller/student.js:85:35
 
         const startTime = new Date(examData.startTime);
         const endTime = new Date(
-            startTime.getTime() + examData.duration * 60000
+            startTime.getTime() + examData.duration / 60000
         ); 
         const currentTime = new Date();
killedBy: student_submit_answer API Function should return 401 if exam is not started or already ended; student_submit_answer API Function should return 401 if exam is not started or already ended
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ArithmeticOperator
backend/controller/student.js:85:13
 
         const startTime = new Date(examData.startTime);
         const endTime = new Date(
-            startTime.getTime() + examData.duration * 60000
+            startTime.getTime() - examData.duration * 60000
         ); 
         const currentTime = new Date();
killedBy: student_submit_answer API Function should return 401 if exam is not started or already ended; student_submit_answer API Function should return 401 if exam is not started or already ended
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] EqualityOperator
backend/controller/student.js:89:12
         ); 
         const currentTime = new Date();
 
-        if(currentTime < startTime || currentTime > endTime + 60000){
+        if(currentTime <= startTime || currentTime > endTime + 60000){
             return res.status(401).json({ message: "Exam is either ended or not started yet"});
         }
killedBy: student_submit_answer API Function should return 401 if exam is not started or already ended; student_submit_answer API Function should return 401 if exam is not started or already ended
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] EqualityOperator
backend/controller/student.js:89:39
         ); 
         const currentTime = new Date();
 
-        if(currentTime < startTime || currentTime > endTime + 60000){
+        if(currentTime < startTime || currentTime >= endTime + 60000){
             return res.status(401).json({ message: "Exam is either ended or not started yet"});
         }
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] StringLiteral
backend/controller/student.js:90:52
         const currentTime = new Date();
 
         if(currentTime < startTime || currentTime > endTime + 60000){
-            return res.status(401).json({ message: "Exam is either ended or not started yet"});
+            return res.status(401).json({ message: ""});
         }
 
killedBy: student_submit_answer API Function should return 401 if exam is not started or already ended; student_submit_answer API Function should return 401 if exam is not started or already ended
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:95:59
 
 
         // Find the exam in the student's data
-        let examIndex = student.givenExams.findIndex(e => String(e.exam) === String(examData._id));
+        let examIndex = student.givenExams.findIndex(e => false);
         let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
 
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:95:59
 
 
         // Find the exam in the student's data
-        let examIndex = student.givenExams.findIndex(e => String(e.exam) === String(examData._id));
+        let examIndex = student.givenExams.findIndex(e => true);
         let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
 
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] EqualityOperator
backend/controller/student.js:96:20
 
         // Find the exam in the student's data
         let examIndex = student.givenExams.findIndex(e => String(e.exam) === String(examData._id));
-        let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
+        let exam = examIndex < 0 ? student.givenExams[examIndex] : null;
 
         // If the exam doesn't exist, add a new entry
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:96:20
 
         // Find the exam in the student's data
         let examIndex = student.givenExams.findIndex(e => String(e.exam) === String(examData._id));
-        let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
+        let exam = false ? student.givenExams[examIndex] : null;
 
         // If the exam doesn't exist, add a new entry
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ConditionalExpression
backend/controller/student.js:99:13
         let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
 
         // If the exam doesn't exist, add a new entry
-        if (!exam) {
+        if (true) {
             exam = {
                 exam: examData._id,
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BooleanLiteral
backend/controller/student.js:99:13
         let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
 
         // If the exam doesn't exist, add a new entry
-        if (!exam) {
+        if (exam) {
             exam = {
                 exam: examData._id,
killedBy: student_submit_answer API Function should return 401 if exam is already submitted
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(401))

[NoCoverage] ArrayDeclaration
backend/controller/student.js:102:28
         if (!exam) {
             exam = {
                 exam: examData._id,
-                questions: [],
+                questions: ["Stryker was here"],
                 obtained_score: 0,
             };

[NoCoverage] ArithmeticOperator
backend/controller/student.js:106:25
                 obtained_score: 0,
             };
             student.givenExams.push(exam);
-            examIndex = student.givenExams.length - 1; // Update the index
+            examIndex = student.givenExams.length + 1; // Update the index
         }
 

[Killed] BlockStatement
backend/controller/student.js:109:27
             examIndex = student.givenExams.length - 1; // Update the index
         }
 
-        if(exam.submitted){
-            return res.status(401).json({ message: "Exam was already submitted"});
-        }
+        if(exam.submitted){}
 
         const questionIndex = exam.questions.findIndex(q => String(q.question) === String(question._id));
killedBy: student_submit_answer API Function should return 401 if exam is already submitted
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(401))

[Killed] ConditionalExpression
backend/controller/student.js:109:12
             examIndex = student.givenExams.length - 1; // Update the index
         }
 
-        if(exam.submitted){
+        if(false){
             return res.status(401).json({ message: "Exam was already submitted"});
         }
killedBy: student_submit_answer API Function should return 401 if exam is already submitted; student_submit_answer API Function should return 401 if exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[NoCoverage] ArrowFunction
backend/controller/student.js:113:56
             return res.status(401).json({ message: "Exam was already submitted"});
         }
 
-        const questionIndex = exam.questions.findIndex(q => String(q.question) === String(question._id));
+        const questionIndex = exam.questions.findIndex(() => undefined);
         const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
 

[NoCoverage] ConditionalExpression
backend/controller/student.js:113:61
             return res.status(401).json({ message: "Exam was already submitted"});
         }
 
-        const questionIndex = exam.questions.findIndex(q => String(q.question) === String(question._id));
+        const questionIndex = exam.questions.findIndex(q => true);
         const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
 

[NoCoverage] ConditionalExpression
backend/controller/student.js:114:31
         }
 
         const questionIndex = exam.questions.findIndex(q => String(q.question) === String(question._id));
-        const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
+        const questionEntry = false ? exam.questions[questionIndex] : null;
 
         // Handle the case where the answer is null

[NoCoverage] EqualityOperator
backend/controller/student.js:114:31
         }
 
         const questionIndex = exam.questions.findIndex(q => String(q.question) === String(question._id));
-        const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
+        const questionEntry = questionIndex > 0 ? exam.questions[questionIndex] : null;
 
         // Handle the case where the answer is null

[NoCoverage] ConditionalExpression
backend/controller/student.js:117:13
         const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
 
         // Handle the case where the answer is null
-        if (answer === null) {
+        if (false) {
             if (questionEntry) {
                 // Remove the question entry and adjust the obtained score

[NoCoverage] BlockStatement
backend/controller/student.js:117:30
         const questionEntry = questionIndex >= 0 ? exam.questions[questionIndex] : null;
 
         // Handle the case where the answer is null
-        if (answer === null) {
-            if (questionEntry) {
-                // Remove the question entry and adjust the obtained score
-                exam.questions.splice(questionIndex, 1);
-
-                if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
-                }
-            }
-        } else {
+        if (answer === null) {} else {
             if (!questionEntry) {
                 // Add a new question and update the score

[NoCoverage] BlockStatement
backend/controller/student.js:118:32
 
         // Handle the case where the answer is null
         if (answer === null) {
-            if (questionEntry) {
-                // Remove the question entry and adjust the obtained score
-                exam.questions.splice(questionIndex, 1);
-
-                if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
-                }
-            }
+            if (questionEntry) {}
         } else {
             if (!questionEntry) {

[NoCoverage] ConditionalExpression
backend/controller/student.js:118:17
 
         // Handle the case where the answer is null
         if (answer === null) {
-            if (questionEntry) {
+            if (false) {
                 // Remove the question entry and adjust the obtained score
                 exam.questions.splice(questionIndex, 1);

[NoCoverage] EqualityOperator
backend/controller/student.js:122:21
                 // Remove the question entry and adjust the obtained score
                 exam.questions.splice(questionIndex, 1);
 
-                if (questionEntry.answer === question.answer) {
+                if (questionEntry.answer !== question.answer) {
                     exam.obtained_score -= question.points;
                 }

[NoCoverage] ConditionalExpression
backend/controller/student.js:122:21
                 // Remove the question entry and adjust the obtained score
                 exam.questions.splice(questionIndex, 1);
 
-                if (questionEntry.answer === question.answer) {
+                if (false) {
                     exam.obtained_score -= question.points;
                 }

[NoCoverage] AssignmentOperator
backend/controller/student.js:123:21
                 exam.questions.splice(questionIndex, 1);
 
                 if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
+                    exam.obtained_score += question.points;
                 }
             }

[NoCoverage] BlockStatement
backend/controller/student.js:126:16
                     exam.obtained_score -= question.points;
                 }
             }
-        } else {
-            if (!questionEntry) {
-                // Add a new question and update the score
-                exam.questions.push({
-                    question: question._id,
-                    answer,
-                });
-
-                if (question.answer === answer) {
-                    exam.obtained_score += question.points;
-                }
-            } else {
-                // Update the existing answer and adjust the score
-                if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
-                }
-
-                exam.questions[questionIndex].answer = answer;
-
-                if (answer === question.answer) {
-                    exam.obtained_score += question.points;
-                }
-            }
-        }
+        } else {}
 
         // Explicitly assign the updated exam back to the student's data

[NoCoverage] ConditionalExpression
backend/controller/student.js:127:17
                 }
             }
         } else {
-            if (!questionEntry) {
+            if (true) {
                 // Add a new question and update the score
                 exam.questions.push({

[NoCoverage] BooleanLiteral
backend/controller/student.js:127:17
                 }
             }
         } else {
-            if (!questionEntry) {
+            if (questionEntry) {
                 // Add a new question and update the score
                 exam.questions.push({

[NoCoverage] ConditionalExpression
backend/controller/student.js:134:21
                     answer,
                 });
 
-                if (question.answer === answer) {
+                if (true) {
                     exam.obtained_score += question.points;
                 }

[NoCoverage] BlockStatement
backend/controller/student.js:134:49
                     answer,
                 });
 
-                if (question.answer === answer) {
-                    exam.obtained_score += question.points;
-                }
+                if (question.answer === answer) {}
             } else {
                 // Update the existing answer and adjust the score

[NoCoverage] AssignmentOperator
backend/controller/student.js:135:21
                 });
 
                 if (question.answer === answer) {
-                    exam.obtained_score += question.points;
+                    exam.obtained_score -= question.points;
                 }
             } else {

[NoCoverage] BlockStatement
backend/controller/student.js:137:20
                 if (question.answer === answer) {
                     exam.obtained_score += question.points;
                 }
-            } else {
-                // Update the existing answer and adjust the score
-                if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
-                }
-
-                exam.questions[questionIndex].answer = answer;
-
-                if (answer === question.answer) {
-                    exam.obtained_score += question.points;
-                }
-            }
+            } else {}
         }
 

[NoCoverage] ConditionalExpression
backend/controller/student.js:139:21
                 }
             } else {
                 // Update the existing answer and adjust the score
-                if (questionEntry.answer === question.answer) {
+                if (false) {
                     exam.obtained_score -= question.points;
                 }

[NoCoverage] BlockStatement
backend/controller/student.js:139:63
                 }
             } else {
                 // Update the existing answer and adjust the score
-                if (questionEntry.answer === question.answer) {
-                    exam.obtained_score -= question.points;
-                }
+                if (questionEntry.answer === question.answer) {}
 
                 exam.questions[questionIndex].answer = answer;

[NoCoverage] ConditionalExpression
backend/controller/student.js:145:21
 
                 exam.questions[questionIndex].answer = answer;
 
-                if (answer === question.answer) {
+                if (false) {
                     exam.obtained_score += question.points;
                 }

[NoCoverage] EqualityOperator
backend/controller/student.js:145:21
 
                 exam.questions[questionIndex].answer = answer;
 
-                if (answer === question.answer) {
+                if (answer !== question.answer) {
                     exam.obtained_score += question.points;
                 }

[NoCoverage] AssignmentOperator
backend/controller/student.js:146:21
                 exam.questions[questionIndex].answer = answer;
 
                 if (answer === question.answer) {
-                    exam.obtained_score += question.points;
+                    exam.obtained_score -= question.points;
                 }
             }

[Killed] BlockStatement
backend/controller/student.js:158:21
         await student.save();
 
         res.json({ message: "Answer updated successfully", updatedExam: exam });
-    } catch (error) {
-        console.log(error);
-        res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: student_submit_answer API Function should return 500 if there is an error during the process; student_submit_answer API Function should return 500 if there is an error during the process
statusReason: Attempted to wrap findOne which is already wrapped
