[Killed] BlockStatement
backend/controller/student.js:166:49
 
 
 
-export const all_students = async (req, res) => {
-    try{
-        const students = await User.find({role: "Student"}).select("-password");
-
-        return res.status(200).json({ students: students, message: "Students fetched successfully"});
-    } catch(error){
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const all_students = async (req, res) => {};
 
 export const delete_student = async (req, res) => {
killedBy: all_students API Function should return 500 if there is an error during the database query
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] BlockStatement
backend/controller/student.js:167:8
 
 
 export const all_students = async (req, res) => {
-    try{
-        const students = await User.find({role: "Student"}).select("-password");
-
-        return res.status(200).json({ students: students, message: "Students fetched successfully"});
-    } catch(error){
+    try{} catch(error){
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: all_students API Function should return 500 if there is an error during the database query
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Survived] ObjectLiteral
backend/controller/student.js:168:42
 
 export const all_students = async (req, res) => {
     try{
-        const students = await User.find({role: "Student"}).select("-password");
+        const students = await User.find({}).select("-password");
 
         return res.status(200).json({ students: students, message: "Students fetched successfully"});

[Killed] BlockStatement
backend/controller/student.js:171:19
         const students = await User.find({role: "Student"}).select("-password");
 
         return res.status(200).json({ students: students, message: "Students fetched successfully"});
-    } catch(error){
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch(error){}
 };
 
killedBy: all_students API Function should return 500 if there is an error during the database query
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] BlockStatement
backend/controller/student.js:177:51
     }
 };
 
-export const delete_student = async (req, res) => {
-    try {
-        const { username } = req.params; 
-
-        if(!username){
-            return res.status(404).json({message: "Username not found"});
-        }
-
-        await Student.deleteOne({ username: username });
-
-        await User.deleteOne({ username: username });
-
-        return res.status(200).json({ message: "Student and associated User deleted successfully." });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
-};
+export const delete_student = async (req, res) => {};
 
 export const get_student = async (req, res) => {
killedBy: delete_student API Function should return 200 and success message when student and user are deleted successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] BlockStatement
backend/controller/student.js:178:9
 };
 
 export const delete_student = async (req, res) => {
-    try {
-        const { username } = req.params; 
-
-        if(!username){
-            return res.status(404).json({message: "Username not found"});
-        }
-
-        await Student.deleteOne({ username: username });
-
-        await User.deleteOne({ username: username });
-
-        return res.status(200).json({ message: "Student and associated User deleted successfully." });
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         return res.status(500).json({ message: error.message });
killedBy: delete_student API Function should return 200 and success message when student and user are deleted successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ObjectLiteral
backend/controller/student.js:182:41
         const { username } = req.params; 
 
         if(!username){
-            return res.status(404).json({message: "Username not found"});
+            return res.status(404).json({});
         }
 
killedBy: delete_student API Function should return 404 if username is not found in the request parameters
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Username not found' }))

[Killed] StringLiteral
backend/controller/student.js:189:48
 
         await User.deleteOne({ username: username });
 
-        return res.status(200).json({ message: "Student and associated User deleted successfully." });
+        return res.status(200).json({ message: "" });
     } catch (error) {
         console.log(error);
killedBy: delete_student API Function should return 200 and success message when student and user are deleted successfully
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Student and associated User deleted successfully.' }))

[Killed] BlockStatement
backend/controller/student.js:190:21
         await User.deleteOne({ username: username });
 
         return res.status(200).json({ message: "Student and associated User deleted successfully." });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: delete_student API Function should return 500 if there is an error during the deletion process
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] EqualityOperator
backend/controller/student.js:200:77
     try{
         const { username } = req.params;
 
-        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Examiner"){
+        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role !== "Examiner"){
             return res.status(400).json({ message: 'Unathorized Access' });
         }
killedBy: get_student API Function should return 400 if the user is unauthorized (role is Examiner)
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] LogicalOperator
backend/controller/student.js:200:12
     try{
         const { username } = req.params;
 
-        if((req.user.role !== "Admin" && username !== req.user.username) || req.user.role === "Examiner"){
+        if(req.user.role !== "Admin" && username !== req.user.username && req.user.role === "Examiner"){
             return res.status(400).json({ message: 'Unathorized Access' });
         }
killedBy: get_student API Function should return 400 if the user is unauthorized (role is Examiner); get_student API Function should return 400 if the user is unauthorized (role is Examiner)
statusReason: Attempted to wrap findOne which is already wrapped

[NoCoverage] StringLiteral
backend/controller/student.js:204:62
             return res.status(400).json({ message: 'Unathorized Access' });
         }
 
-        const user = await User.findOne({ username }).select("-password");
+        const user = await User.findOne({ username }).select("");
         const student = await Student.findOne({ username }).select("-username -givenExams");
 

[NoCoverage] ObjectLiteral
backend/controller/student.js:205:47
         }
 
         const user = await User.findOne({ username }).select("-password");
-        const student = await Student.findOne({ username }).select("-username -givenExams");
+        const student = await Student.findOne({}).select("-username -givenExams");
 
         if(!user || !student){

[NoCoverage] LogicalOperator
backend/controller/student.js:207:12
         const user = await User.findOne({ username }).select("-password");
         const student = await Student.findOne({ username }).select("-username -givenExams");
 
-        if(!user || !student){
+        if(!user && !student){
             return res.status(404).json({message: "Student not found"});
         }

[NoCoverage] BooleanLiteral
backend/controller/student.js:207:21
         const user = await User.findOne({ username }).select("-password");
         const student = await Student.findOne({ username }).select("-username -givenExams");
 
-        if(!user || !student){
+        if(!user || student){
             return res.status(404).json({message: "Student not found"});
         }

[NoCoverage] ObjectLiteral
backend/controller/student.js:208:41
         const student = await Student.findOne({ username }).select("-username -givenExams");
 
         if(!user || !student){
-            return res.status(404).json({message: "Student not found"});
+            return res.status(404).json({});
         }
 

[NoCoverage] StringLiteral
backend/controller/student.js:208:51
         const student = await Student.findOne({ username }).select("-username -givenExams");
 
         if(!user || !student){
-            return res.status(404).json({message: "Student not found"});
+            return res.status(404).json({message: ""});
         }
 

[NoCoverage] ObjectLiteral
backend/controller/student.js:235:37
         // console.log(response);
         
 
-        return res.status(200).json({user: response, message: "Profile Feched Successfully"});
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/student.js:236:21
         
 
         return res.status(200).json({user: response, message: "Profile Feched Successfully"});
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: get_student API Function should return 500 if there is an error in fetching the student profile
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] LogicalOperator
backend/controller/student.js:248:12
         const { firstname, lastname, middlename, dob, mobileno, email, gender, batch, branch, graduation } = req.body;
         
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender || !batch || !branch || !graduation){
+        if((!username || !firstname || !lastname || !dob || !mobileno || !email || !gender) && !batch || !branch || !graduation){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: update_student API Function should return 400 if required fields are missing
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] LogicalOperator
backend/controller/student.js:248:12
         const { firstname, lastname, middlename, dob, mobileno, email, gender, batch, branch, graduation } = req.body;
         
 
-        if(!username || !firstname || !lastname || !dob || !mobileno || !email || !gender || !batch || !branch || !graduation){
+        if((!username || !firstname || !lastname || !dob) && !mobileno || !email || !gender || !batch || !branch || !graduation){
             return res.status(400).json({ message: 'All fields are required!' });
         }
killedBy: update_student API Function should return 400 if required fields are missing
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] ConditionalExpression
backend/controller/student.js:252:41
             return res.status(400).json({ message: 'All fields are required!' });
         }
 
-        if(req.user.role !== "Admin" && username !== req.user.username){
+        if(req.user.role !== "Admin" && true){
             return res.status(400).json({ message: 'Unathorized Access' });
         }
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] EqualityOperator
backend/controller/student.js:252:41
             return res.status(400).json({ message: 'All fields are required!' });
         }
 
-        if(req.user.role !== "Admin" && username !== req.user.username){
+        if(req.user.role !== "Admin" && username === req.user.username){
             return res.status(400).json({ message: 'Unathorized Access' });
         }
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] Regex
backend/controller/student.js:257:28
         }
 
         // Email validation (basic regex pattern for email format)
-        const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailRegex = /^[^\S@]+@[^\s@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
             return res.status(400).json({ message: 'Invalid email format.' });
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ConditionalExpression
backend/controller/student.js:258:13
 
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-        if (!emailRegex.test(email)) {
+        if (false) {
             return res.status(400).json({ message: 'Invalid email format.' });
         }
killedBy: update_student API Function should return 400 if the email format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] BlockStatement
backend/controller/student.js:258:38
 
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-        if (!emailRegex.test(email)) {
-            return res.status(400).json({ message: 'Invalid email format.' });
-        }
+        if (!emailRegex.test(email)) {}
 
         // Check mobile number length (assuming mobile number should be exactly 10 digits)
killedBy: update_student API Function should return 400 if the email format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] ObjectLiteral
backend/controller/student.js:259:41
         // Email validation (basic regex pattern for email format)
         const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
         if (!emailRegex.test(email)) {
-            return res.status(400).json({ message: 'Invalid email format.' });
+            return res.status(400).json({});
         }
 
killedBy: update_student API Function should return 400 if the email format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Invalid email format.' }))

[Killed] ConditionalExpression
backend/controller/student.js:264:13
 
         // Check mobile number length (assuming mobile number should be exactly 10 digits)
         const mobilenoRegex = /^\d{10}$/;
-        if (!mobilenoRegex.test(mobileno)) {
+        if (false) {
             return res.status(400).json({ message: 'Mobile number must be exactly 10 digits.' });
         }
killedBy: update_student API Function should return 400 if the mobile number format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(400))

[Killed] Regex
backend/controller/student.js:269:26
         }
 
         // DOB validation (expecting format 'YYYY-MM-DD')
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\D{4}-\d{2}-\d{2}$/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Survived] Regex
backend/controller/student.js:269:26
         }
 
         // DOB validation (expecting format 'YYYY-MM-DD')
-        const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
+        const dobRegex = /^\d{4}-\d{2}-\d{2}/;
         if (!dobRegex.test(dob)) {
             return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });

[Killed] BlockStatement
backend/controller/student.js:270:34
 
         // DOB validation (expecting format 'YYYY-MM-DD')
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
-        if (!dobRegex.test(dob)) {
-            return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
-        }
+        if (!dobRegex.test(dob)) {}
 
         const [year, month, day] = dob.split('-').map(Number);
killedBy: update_student API Function should return 400 if the date of birth format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' }))

[Killed] StringLiteral
backend/controller/student.js:271:52
         // DOB validation (expecting format 'YYYY-MM-DD')
         const dobRegex = /^\d{4}-\d{2}-\d{2}$/;
         if (!dobRegex.test(dob)) {
-            return res.status(400).json({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' });
+            return res.status(400).json({ message: "" });
         }
 
killedBy: update_student API Function should return 400 if the date of birth format is invalid
statusReason: The expression evaluated to a falsy value:

  assert(res.json.calledWith({ message: 'Invalid date of birth format. Use YYYY-MM-DD.' }))

[Killed] EqualityOperator
backend/controller/student.js:278:44
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if (date.getFullYear() !== year || date.getMonth() + 1 === month || date.getDate() !== day) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[Killed] ArithmeticOperator
backend/controller/student.js:278:44
         const date = new Date(year, month - 1, day); // Month is 0-indexed in JS Date
 
         // Check for valid day, month, and year in dob
-        if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
+        if (date.getFullYear() !== year || date.getMonth() - 1 !== month || date.getDate() !== day) {
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
killedBy: update_student API Function should return 200 and updated student data on successful update
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(200))

[NoCoverage] ObjectLiteral
backend/controller/student.js:279:41
 
         // Check for valid day, month, and year in dob
         if (date.getFullYear() !== year || date.getMonth() + 1 !== month || date.getDate() !== day) {
-            return res.status(400).json({ message: 'Invalid date of birth values.' });
+            return res.status(400).json({});
         }
 

[Survived] ObjectLiteral
backend/controller/student.js:282:50
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
 
-        const user = await User.findOneAndUpdate({username}, {
+        const user = await User.findOneAndUpdate({}, {
             firstname,
             lastname,

[Survived] ObjectLiteral
backend/controller/student.js:282:62
             return res.status(400).json({ message: 'Invalid date of birth values.' });
         }
 
-        const user = await User.findOneAndUpdate({username}, {
-            firstname,
-            lastname,
-            middlename,
-            dob:date,
-            mobileno,
-            email,
-            gender
-        }, { new: true });
+        const user = await User.findOneAndUpdate({username}, {}, { new: true });
 
         const student = await Student.findOneAndUpdate({username}, {

[Survived] BooleanLiteral
backend/controller/student.js:290:19
             mobileno,
             email,
             gender
-        }, { new: true });
+        }, { new: false });
 
         const student = await Student.findOneAndUpdate({username}, {

[Survived] ObjectLiteral
backend/controller/student.js:290:12
             mobileno,
             email,
             gender
-        }, { new: true });
+        }, {});
 
         const student = await Student.findOneAndUpdate({username}, {

[Survived] ObjectLiteral
backend/controller/student.js:300:37
 
         await student.save();
 
-        return res.status(200).json({ message: "Student updated successfully", user: user });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/student.js:301:21
         await student.save();
 
         return res.status(200).json({ message: "Student updated successfully", user: user });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: update_student API Function should return 500 if there is an error in updating the student data
statusReason: The expression evaluated to a falsy value:

  assert(res.status.calledOnceWith(500))

[Killed] ConditionalExpression
backend/controller/student.js:327:13
         // Find the exam by ID without fetching questions
         const examData = await Exam.findOne({ examId });
 
-        if (!examData) {
+        if (true) {
             return res.status(404).json({ message: "Exam not found." });
         }
killedBy: submit_exam_student API Function should return 404 if exam is not found; submit_exam_student API Function should return 404 if exam is not found
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] BlockStatement
backend/controller/student.js:337:69
         ); 
         const currentTime = new Date();
 
-        if(currentTime < startTime || currentTime > endTime + 60000){
-            return res.status(401).json({ message: "Exam is either ended or not started yet"});
-        }
+        if(currentTime < startTime || currentTime > endTime + 60000){}
 
         // Find the exam in the student's data
killedBy: submit_exam_student API Function should return 401 if the exam is not within the allowed time range; submit_exam_student API Function should return 401 if the exam is not within the allowed time range
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] LogicalOperator
backend/controller/student.js:337:12
         ); 
         const currentTime = new Date();
 
-        if(currentTime < startTime || currentTime > endTime + 60000){
+        if(currentTime < startTime && currentTime > endTime + 60000){
             return res.status(401).json({ message: "Exam is either ended or not started yet"});
         }
killedBy: submit_exam_student API Function should return 401 if the exam is not within the allowed time range; submit_exam_student API Function should return 401 if the exam is not within the allowed time range
statusReason: Attempted to wrap findOne which is already wrapped

[Killed] ArrowFunction
backend/controller/student.js:342:54
         }
 
         // Find the exam in the student's data
-        let examIndex = student.givenExams.findIndex(e => String(e.exam) === String(examData._id));
+        let examIndex = student.givenExams.findIndex(() => undefined);
         let exam = examIndex >= 0 ? student.givenExams[examIndex] : null;
 
killedBy: submit_exam_student API Function should return 401 if the exam is already submitted; submit_exam_student API Function should return 401 if the exam is already submitted
statusReason: Attempted to wrap findOne which is already wrapped

[Survived] BooleanLiteral
backend/controller/student.js:359:26
             return res.status(401).json({ message: "Exam was already submitted"});
         }
 
-        exam.submitted = true;
+        exam.submitted = false;
 
         student.givenExams[examIndex] = exam;

[NoCoverage] ObjectLiteral
backend/controller/student.js:365:37
 
         await student.save();
 
-        return res.status(200).json({ 
-            message: "Exam submitted Successfully"
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
backend/controller/student.js:368:21
         return res.status(200).json({ 
             message: "Exam submitted Successfully"
         });
-    } catch (error) {
-        console.log(error);
-        return res.status(500).json({ message: "Failed to submit exam" });
-    }
+    } catch (error) {}
 }
killedBy: submit_exam_student API Function should return 500 if there is an internal error in saving student data; submit_exam_student API Function should return 500 if there is an internal error in saving student data
statusReason: Attempted to wrap findOne which is already wrapped
